{
    //Raven
        //Egg Festival
            "raven.festival.dialogue.eggFestival_1": "It's really fun watching the kids get competitive during the egg hunt.#$b#It really makes me wish I had my own kids.",
            "raven.festival.dialogue.eggFestival_2": "How come they don't call the Egg Festival 'Egg Day'?#$e#It makes more sense to me for some reason.",
            "raven.festival.dialogue.eggFestival_3": "There's never enough deviled eggs at the Egg Festival. It's kinda sad.#$b#It's not my fault I like deviled eggs. They're really tasty!",
            "raven.festival.dialogue.eggFestival_4": "I wonder what Gus decided to bring this year! I absolutely love his cooking.",
            "raven.festival.dialogue.eggFestival_5": "Did you bring any eggs for the egg festival?#$e#Well, I guess that depends on if you have chickens.",
            "raven.festival.dialogue.eggFestival_spouse": "We'll see if you win this year, love. I'm rooting for you!$1",
        //Flower Dance
            "raven.festival.dialogue.flowerDance_1": "The temperature is just right for the Flower Dance! No one has to worry about sweating up a storm.$1",
            "raven.festival.dialogue.flowerDance_2": "Everyone looks great today!#$e#The dresses look much better than the suits, though.$17",

            "raven.festival.flowerDance.decline": "Sorry, but I plan on just watching the dance this year.#$b#I appreciate you asking though!",

            "raven.festival.flowerDance.accept_1": "Wait, you actually want to dance with me?#$b#I appreciate it! I hope I don't accidentally step on your toes.",
            "raven.festival.flowerDance.accept_2": "Aw, I'm really happy you asked! Sure I'll dance with you.",
            "raven.festival.flowerDance.accept_3": "Really? Me?#$b#Awesome, I can't wait! We're gonna do great out there.",

            "raven.festival.flowerDance.spouse.accept_1": "You don't need to ask, of course I'll dance with you!$1",
            "raven.festival.flowerDance.spouse.accept_2": "I'll dance with you any day! I'll see you when the dance starts.$6",
            "raven.festival.flowerDance.spouse.accept_3": "Aw, you're so sweet! I'll definitely dance with you honey.$4",
        //Luau/Potluck
            "raven.festival.dialogue.luau_1": "My stomach is growling right now. When are we gonna eat?$2#$e#What do you mean Mayor Lewis is waiting for you? Why do you get to decide when to start?$17#$b#Meh, Mayor Lewis doesn't make sense sometimes.",
            "raven.festival.dialogue.luau_2": "Not gonna lie, it's pretty hot outside right now. I can feel the sweat and I hate it.$17#$e#I wonder if anyone's gonna go into the water to cool down.$17#$b#Would it be so bad if I went in first?$11",

            "raven.festival.dialogue.spouse.luau_1": "My stomach is growling right now. When are we gonna eat?$2#$e#Don't take too long. I know Mayor Lewis is waiting for you so we can eat.",
            "raven.festival.dialogue.spouse.luau_2": "Not gonna lie, it's pretty hot outside right now. I can feel the sweat and I hate it.$17#$e#You should take a dip in the water with me so we can cool off.$1",
        //Stardew Valley Fair
            "raven.festival.dialogue.stardewValleyFair_1": "I can't wait to see who wins the grange display contest this year!$1",
            "raven.festival.dialogue.stardewValleyFair_2": "I love doing the fishing game!$1#$b#It'd be nice if we could keep some though.$11",

            "raven.festival.stardewValleyFair.judging_1": "It'd be awesome if you won this year!#$b#Your crops always have a wonderful taste to them.",
            "raven.festival.stardewValleyFair.judging_2": "I wonder what the grossest thing Lewis has ever came across while judging.",
            "raven.festival.stardewValleyFair.judging_3": "Even though I never participate, I still get excited to see who wins the grange display contest!",

            "raven.festival.stardewValleyFair.judged.playerLost.purpleShorts": "It seems like I'm not the only one that knows about Mayor Lewis' secrets.#$b#Let's give him hell.",

            "raven.festival.stardewValleyFair.judged.playerLost.skipped_1": "Hopefully you participate next year! It'd be awesome to see what you put on display.",
            "raven.festival.stardewValleyFair.judged.playerLost.skipped_2": "I understand if you skipped the competition because of nervousness.#$b#I can imagine not every season can get you the best crops. Nature is a massive lottery if you think about it.",
            "raven.festival.stardewValleyFair.judged.playerLost.skipped_3": "I was looking forward to seeing your display this year, but it's okay.#$b#I can always visit the farm to take a look at how things are going.",

            "raven.festival.stardewValleyFair.judged.playerLost_1": "You did your best, @.#$b#I know that Mayor Lewis is quite biased when it comes to competitions he hosts though.",
            "raven.festival.stardewValleyFair.judged.playerLost_2": "Don't worry about losing. You still put up some cool stuff!#$e#You're an underrated artist.#$b#Yeah, crops can be considered art. Leah would probably agree with you.",
            "raven.festival.stardewValleyFair.judged.playerLost_3": "Keep your head up! Your display was still awesome.",

            "raven.festival.stardewValleyFair.judged.playerWon_1": "I'm really proud of you! I was hoping you'd win.",
            "raven.festival.stardewValleyFair.judged.playerWon_2": "Nice fuckin' job!$1#$b#Oh shit, do you think Mayor Lewis heard me cuss?$17#$e#I feel like Mayor Lewis would have a heart attack if he heard anyone cuss around him.$11",
            "raven.festival.stardewValleyFair.judged.playerWon_3": "Ayy, look at this year's winner!",

            "raven.festival.stardewValleyFair.judged_1": "Everyone did great this year.$1#$b#I kinda wonder what I would put on a grange display.",
            "raven.festival.stardewValleyFair.judged_2": "Everyone did great this year.$1#$b#I love seeing the creativity!$1",
            "raven.festival.stardewValleyFair.judged_3": "Everyone did great this year.$1#$b#Do you think the kids would ever make their own grange displays?$17",
        //Spirit's Eve
            "raven.festival.dialogue.spiritsEve_1": "I used to be scared of Spirit's Eve as a little kid. I sure was silly back then!$1",
            "raven.festival.dialogue.spiritsEve_2": "You should try out some of the food! It's amazing, trust me.$1",
            "raven.festival.dialogue.spiritsEve_3": "It'd be kinda funny if someone TP'd Pierre's shop.$1#$e#Do I need a reason to not like Pierre? He seems sketchy to me.$17",
            "raven.festival.dialogue.spiritsEve_4": "Tada! What do you think of my Spirit's Eve costume?#$e#I think you look great.$1",
        //Festival of Ice
            "raven.festival.dialogue.festivalOfIce_1": "I'm naming my snowperson Larry!#$e#Or should I name it Genevieve?",
            "raven.festival.dialogue.festivalOfIce_2": "I wonder when Lewis is gonna start the fishing competition.#$e#I wanna see how many fish everyone catches!",
            "raven.festival.dialogue.festivalOfIce_3": "Hm... I think I wanna play a prank on Mayor Lewis, but I don't know what to do.$17#$e#Maybe you can help me figure something out?",
        //Feast of the Winter Star
            "raven.festival.dialogue.winterStar_1": "I love seeing everyone smiling and having a good time!#$e#Maybe one of these days I can have a family of my own to spend festivals with.",
            "raven.festival.dialogue.winterStar_2": "There's so many presents at the tree this year!#$e#I wonder if some people get double-gifted.#$b#How much do you wanna bet that Mayor Lewis rigs these events?",
            "raven.festival.dialogue.winterStar_3": "There's something about the snow that makes tonight feel magical.#$e#Don't ask me to explain it. It's just a feeling I have.",
            "raven.festival.dialogue.winterStar_4": "Hi @! I wonder who your secret gift giver is this year.#$e#Hopefully you get something you like!",
            "raven.festival.dialogue.winterStar_5": "I think I found a rotten Egg Festival egg in a bush by Mayor Lewis' house.#$e#Trust me, you don't wanna smell it.",

            "raven.festival.dialogue.spouse.winterStar_1": "I love seeing everyone smiling and having a good time!#$e#I especially love to spend time with you, honey.$4",
            "raven.festival.dialogue.spouse.winterStar_2": "There's so many presents at the tree this year!#$e#I wonder if some people get double-gifted.#$b#How much do you wanna bet that Mayor Lewis rigs these events?",
            "raven.festival.dialogue.spouse.winterStar_3": "There's something about the snow that makes tonight feel magical.#$e#Don't ask me to explain it. It's just a feeling I have.",
            "raven.festival.dialogue.spouse.winterStar_4": "Hi @! I wonder who your secret gift giver is this year.#$e#Hopefully I get you as my secret gift giver.$4",
            "raven.festival.dialogue.spouse.winterStar_5": "I think I found a rotten Egg Festival egg in a bush by Mayor Lewis' house.#$e#Trust me, you don't wanna smell it.",

            "raven.festival.dialogue.winterStar_giveGift.spouse.before_1": "Surprise! I'm your secret gift giver!#$b#I have a feeling you'll love it.",
            "raven.festival.dialogue.winterStar_giveGift.spouse.before_2": "Hi babe, you managed to get me this year!#$b#I worked had to get this ready for you.",
            "raven.festival.dialogue.winterStar_giveGift.spouse.before_3": "Guess who you got, honey!#$b#I hope you didn't find the gift early and try to sneak a peek already.",

            "raven.festival.dialogue.winterStar_giveGift.before_1": "Surprise, @! I'm your secret gift giver.#$b#I had a hard time thinking of something but I think this is perfect.",
            "raven.festival.dialogue.winterStar_giveGift.before_2": "Hi, @, I'm your secret gift giver!#$b#Go ahead and open it. I wanna see your reaction!",
            "raven.festival.dialogue.winterStar_giveGift.before_3": "Guess who it is?#$b#Open it up, I'm excited to see your face.",

            "raven.festival.dialogue.winterStar_giveGift.spouse.after_1": "I really hope you enjoy the gift, love! I spent a lot of time putting it together.",
            "raven.festival.dialogue.winterStar_giveGift.spouse.after_2": "Now I gotta think about what to get you next year if I get picked for you again!#$b#But I'll do it gladly.",
            "raven.festival.dialogue.winterStar_giveGift.spouse.after_3": "There's more presents waiting for you at home, darling. I wanna make sure I can spoil you.",

            "raven.festival.dialogue.winterStar_giveGift.after_1": "I really hope you enjoy the gift! It took a while to put together.",
            "raven.festival.dialogue.winterStar_giveGift.after_2": "I hope you get a lot of use out of your present!",
            "raven.festival.dialogue.winterStar_giveGift.after_3": "If you ever need a replacement because you lost or broke your gift, let me know and I'll add it to next year's gift!",

            "raven.festival.dialogue.winterStar_receiveGift_1": "Oh, thanks so much! I can tell you put a lot of thought into it.",
            "raven.festival.dialogue.winterStar_receiveGift_2": "Aw, thanks for the gift! It's always great to see who my secret gift giver is for the year.",
            "raven.festival.dialogue.winterStar_receiveGift_3": "I bet it took a while to get this for me, thanks!",
    //Zayden
        //Egg Festival
            "zayden.festival.eggFestival_1": "I kinda wish there were less people here.$9#$b#I don't like crowded places. I like the festival itself, though.",
            "zayden.festival.eggFestival_2": "I stay in the shade so I don't irritate my skin.#$e#It sucks getting heat rashes...$4",
            "zayden.festival.eggFestival_3": "Do you think people have tried cheating at egg hunts before?$9",
        //Flower Dance
            "zayden.festival.flowerDance_1": "There's hardly any shade around here. Hopefully I don't get a rash.$3",
            "zayden.festival.flowerDance_2": "The flowers smell really nice this year.$1",
        //Luau / Potluck
            "zayden.festival.luauPotluck_1": "... I have a rash from the heat...$4",
            "zayden.festival.luauPotluck_2": "Hopefully we get started soon... I might need to leave early if it takes much longer.$5",
        //Dance of the Moonlight Jellies
            "zayden.festival.moonlightJellies_1": "The jellyfish are pretty cool.#$e#It'd be nice if they came more often, though.$3",
            "zayden.festival.moonlightJellies_2": "I bet it's nice to be a jellyfish. You can just go wherever the water takes you.",
        //Stardew Valley Fair
            "zayden.festival.stardewValleyFair_1": "The weather is very nice right now.$1#$e#I plan on doing the slingshot game. I have pretty good aim!$1",
            "zayden.festival.stardewValleyFair_2": "The food is pretty good this year!$1#$e#I wish there was an ice cream truck so I could eat those ugly character popsicles.$2",
        //Spirit's Eve
            "zayden.festival.spiritsEve_1": "I do the maze with Raven every year. I get a kick out of their screams.$1#$b#Give Raven a little time and they'll get brave enough to keep going.$10",
            "zayden.festival.spiritsEve_2": "The decorations are very well done this year!$1#$e#It'd be cool if we had an area where we could watch spooky movies, you know?$7",
            "zayden.festival.spiritsEve_3": "I don't find it weird when people dress up as vampires for Spirit's Eve.#$b#I only have an issue when people dress up to make fun of vampires.$2",
        //Festival of Ice
            "zayden.festival.festivalOfIce_1": "It's so bright outside that I need to wear sunglasses.#$e#I wish the snow wasn't so reflective.$4",
            "zayden.festival.festivalOfIce_2": "I love seeing how creative everyone gets during the festival.$1",
}