{
    //Raven
        //The Brave Little Sapling - Spring 0
            "raven.movie.theBraveLittleSapling.before": "I really think this'll be a great movie!#$b#Not only does the poster look amazing, but it seems like a sweet story.",
            "raven.movie.theBraveLittleSapling.during": "Raven is watching with a big smile on their face.",
            "raven.movie.theBraveLittleSapling.after": "That was so sweet, I really enjoyed it!#$b#I'd definitely watch it again.#$e#It must've been so hard for the little sapling to go on an adventure all alone.",
        //Natural Wonders - Spring 1
            "raven.movie.naturalWonders.before": "For some reason, nature documentaries always make me think of 'March of the Dolphins'.#$b#It's funny since dolphins can't even walk!",
            "raven.movie.naturalWonders.during": "Raven is starting to doze off.",
            "raven.movie.naturalWonders.after": "Sorry, I tried to stay awake.#$b#Something about documentaries make me sleepy as hell.",
        //Journey of the Prairie King - Summer 0
            "raven.movie.journeyOfThePrarieKing.before": "Abigail talks about the video game a bunch. I hope the movie is as good as the games sound!",
            "raven.movie.journeyOfThePrarieKing.during": "Raven's eyes are glued to the screen.",
            "raven.movie.journeyOfThePrarieKing.after": "I really loved this movie!#$b#I should see if Abigail is willing to let me play the game with her.",
        //Wumbus - Summer 1
            "raven.movie.wumbus.before": "Philip told me that this is based on a comic book series.#$b#It's hard to go wrong with adapting comic books!#$b#... Right?",
            "raven.movie.wumbus.during": "I love how goofy this is!#$b#*whispers* Oh, sorry!",
            "raven.movie.wumbus.after": "This is something I'd totally love to see again!#$b#The way it parodies modern society is hilarious!",
        //Mysterium - Fall 0
            "raven.movie.mysterium.before": "I know that it's the point of the movie's name, but I wonder how mysterious it's gonna be!",
            "raven.movie.mysterium.during": "Raven is nervous, but is very focused.",
            "raven.movie.mysterium.after": "That was p-pretty spooky!#$b#I-I know it's just a movie... but...#$b#Do I actually need to tell someone to watch the movie so I don't see that thing in the middle of the night?#$e#I-I'm probably just being silly.#$b#It was a good movie though!",
        //It Howls in the Rain - Fall 1
            "raven.movie.itHowlsInTheRain.before": "It's been a while since I last saw a scary movie.#$b#I bet it'll be awesome!",
            "raven.movie.itHowlsInTheRain.during": "Raven is nervous and their eyes are wide open.",
            "raven.movie.itHowlsInTheRain.after": "It was hyping itself up to be an actually scary movie, but it didn't freak me out much.#$b#Cheap jumpscares, and I bet the footage wasn't actually found in Grampleton.#$e#Hush, I know I was shaking at first.",
        //Miracle of the Winter Star - Winter 0
            "raven.movie.miracleOfTheWinterStar.before": "I wonder if this is gonna be one of those cheesy feel-good movies.",
            "raven.movie.miracleOfTheWinterStar.during": "Raven's eyes dart from the screen for a brief moment. They seem uncomfortable.",
            "raven.movie.miracleOfTheWinterStar.after": "I don't know how to explain it all too well, but it seemed... odd to me.#$b#It's nothing to do with you! You’re fine!#$b#It's just weird how the Winter Star blessed that ONE family over others that may have also been dealing with food shortages.#$e#I'm probably putting too much thought into it.",
        //The Zuzu City Express - Winter 1
            "raven.movie.theZuzuCityExpress.during": "Raven has tears welling up in their eyes.",
            "raven.movie.theZuzuCityExpress.after": "I hate cliffhangers, but it was well done in this one!#$b#There's a charm to the movies from that era that I don't think I could ever get sick of.",
    
    //Zayden
}