{
    //Raven
        //0 Hearts
            "raven.dialogue.0hearts_1": "Some of the people here say that I have a lot to say.#$e#I can't tell if that's supposed to be a bad thing or not, though.$17",
            "raven.dialogue.0hearts_2": "If you take medications, you can go to Harvey's clinic.#$b#He also sells Ferngill Medical Board approved medications for exhaustion and energy. They work instantly!$1",
            "raven.dialogue.0hearts_3": "I love the library here. There are so many books!$1$#b#There's not nearly enough fantasy in there though..$2",
            "raven.dialogue.0hearts_4": "I know it's weird seeing me nap random places, but since I live out of a tent, I either sleep there or wherever else I can.$11#$e#I know living out of a tent isn't the best, but it's not like a house is gonna appear out of nowhere for me.$2#$b#Pelican Town needs more space for housing if they want more people to move in.$$11",
            "raven.dialogue.0hearts_5": "Mayor Lewis has a strange vibe to him.$17#$b#I don't know what it is, but I feel like he's hiding some secrets.$5#$e#Don't take my word for it though. I could be completely wrong!$11",
            "raven.dialogue.0hearts_6": "Pelican Town has quite the collection of secrets.#$e#I'm just saying, some people are worth side-eyeing.$17",
            "raven.dialogue.0hearts_7": "If you ever talk to Clint... Just be careful. He's got an entire incel vibe to him.$2#$b#I figured I'd let you know.^I figured I'd let you know since I know you're his type.$2",
            "raven.dialogue.0hearts_8": "It'd be nice if Pelican Town had more events. I like when everyone gets together.#$b#It also gives people days off from work.$1",
            "raven.dialogue.0hearts_9": "Have you been getting along with people in town fine?#$e#That's interesting!$1",
            "raven.dialogue.0hearts_10": "I work at the Saloon a few days a week. I really enjoy being a janitor there.#$e#Did you know that Gus lets staff sit down? We don't have to stand all the time!$3#$b#It's much better than my previous jobs.#$e#It's not like I spend my whole shift sitting, but if I need a breather, he won't judge us for it.$3",
        //2 Hearts
            "raven.query.wildClans": "I should see if Gunther added any new books to the library. I'm dying to see some new books!$1",
            "raven.dialogue.2hearts_1": "I'm glad we have a library in town. It helps give me more things to do!$1",
            "raven.dialogue.2hearts_2": "I love how I can learn more about the people in town just from working at the Saloon.#$b#Sometimes you feel bad for some of the people, though.$2",
            "raven.dialogue.2hearts_3": "How are things going for you today?#$e#My day is just like any other day. Kinda boring.$11",
            "raven.dialogue.2hearts_4": "Sometimes it's hard to figure out what to talk about since my life is pretty repetitive.$2#$e#When everything is the same all the time, there's nothing new to talk about.$11",
            "raven.dialogue.2hearts_5": "",
            "raven.dialogue.2hearts_6": "I've had people tell me that I'm really energetic in odd situations.$17#$b#Doctors and dentists always get confused because I'm so upbeat at appointments.$1",
            "raven.dialogue.2hearts_7": "I wish there were more frogs here. They're so cool.$1",
        //4 Hearts
            "raven.dialogue.4hearts_1": "Sometimes I wonder if I should try to move back to the city again.$17#$b#I don't think I'd be able to afford it, though.$11",
            "raven.dialogue.4hearts_2": "I'm thinking of also working at Pierre's Seed Shop.$17#$e#Sure, I'm working at the Saloon, but I think I'll be able to pull it off!$1#$b#I'm not certain about it yet, but we'll see.",
            "raven.dialogue.4hearts_3": "I've been looking at books on managing finances lately, but it's not really that I spend too much money.$2#$b#The problem is that everything I need costs more than it should.$12#$e#At least I don't own a car. Those things are so expensive and break down at the worst times.$11",
            "raven.dialogue.4hearts_4": "I've been thinking of moving in to the Pelican Valley Loft. It's more affordable than Zuzu City!#$b#The downside is that it'll take longer to move things from my storage unit in the city.$2#$e#I'm saving up my money first though.",
            "raven.dialogue.4hearts_5": "Not gonna lie, it's hard sleeping outdoors, even in a tent.$2#$b#The ground is really hard and I sometimes get bruises from it.$2",
        //6 Hearts
            "raven.query.jobInterview": "I've been thinking about picking up a second job so I could move back to the city...$17#$b#Hopefully I can find a job that works well for me.$1",
            "raven.dialogue.6hearts_1": "*yawn* Sorry, I'm super drowsy. Pierre has been having me put in a lot of hours lately.$2",
            "raven.dialogue.6hearts_2": "...",
        //8 Hearts - Platonic
            "raven.query.apartment": "@! @!#$b#$y `Did you read the letter I sent yet?_No._Don't worry, I can tell you. I finally got an apartment!$3_I did!_#$action AddFriendshipPoints {{Raven}} 5#That's great @! It's great that it finally happened.$1#$b#Come to my place when you can. I'm almost done unpacking!",
            "raven.dialogue.8hearts_1": "I'm talking with Mayor Lewis about if I can open a coffee shop here!#$e#I just need to find a place to build it.",
            "raven.dialogue.8hearts_2": "Just imagine there being a coffee shop in town. That would be pretty neat, wouldn't it?$1",
        //8 Hearts - Romantic
            "raven.dialogue.8hearts.dating_1": "This might be a lot to ask for, but could you put in a good word for me with Mayor Lewis?#$b#I'm trying to open a coffee shop, but I need him to trust that I'll do what I can to make sure it provides more jobs to people in town, you know?",
            "raven.dialogue.8hearts.dating_2": "You know how some people in town don't have jobs? Well, I wanna try to change that.#$e#Everyone deserves a shot, even in small towns.",
        //10 Hearts
            "raven.dialogue.10hearts_1": "It's wonderful being able to run a coffee shop!$1#$b#It does get pretty exhausting though, but it's very rewarding.$1",
            "raven.dialogue.10hearts_2": "I really love talking to you. You make me feel spiritually 'at home'. It's a great feeling!$1",
            
    //Zayden
        //0 Hearts
            "zayden.dialogue.0hearts_1": "I normally stay away from direct sunlight.#$b#It's not that I sunburn easily, but too much sun isn't good for my skin.$2#$e#No, I don't care that the sun causes aging.#$b#*whispers* It's kinda a dumb reason to hate the sun...$3",
            "zayden.dialogue.0hearts_2": "The heat isn't an issue for me. The problem is when the sun's directly on me for too long.#$e#What happens when I'm in the sun for too long?$9#$b#I get heat rashes. It's really uncomfortable.$4",
            "zayden.dialogue.0hearts_3": "I'm curious about something...#$b#$y 'Are you gonna focus on raising animals, crops, or making artisan goods?_Raising animals_That'll be pretty profitable as long as you stay consistent. You'll do fine.$7_Raising crops_I hear that once you get sprinklers all over the farm that it gets way easier from there. You've got this._Artisan goods_Listen... If you end up making cheese, can you save some for me? I'll be sure to pay you for it.$2",
            "zayden.dialogue.0hearts_4": "I know I'm not super expressive. I'm just not the type to really... care about putting on a performance?$2#$b#That's what it feels like to be really expressive. It's not really authentic for me.",
            "zayden.dialogue.0hearts_5": "I smell like sunscreen? Well, yeah. I wear sunscreen.#$b#*whispers* Is it bad to have sensitive skin?$4",
            "zayden.dialogue.0hearts_6": "$y 'You have a question?_Are you a vampire?_Well, yeah. It's not exactly a secret.$2_Show me your fangs._... No. That's weird to ask that.$4'",
            "zayden.dialogue.0hearts_7": "$y 'You have a question?_Are you allergic to garlic?_No. It actually tastes really good in spaghetti._What do you think of mirrors?_They're okay I guess. They're not all too special.'",
        //2 Hearts
            "zayden.dialogue.2hearts_1": "",
            "zayden.dialogue.2hearts_2": "",
            "zayden.dialogue.2hearts_3": "",
            "zayden.dialogue.2hearts_4": "",
            "zayden.dialogue.2hearts_5": "",
            "zayden.dialogue.2hearts_6": "",
            "zayden.dialogue.2hearts_7": "",
        //4 Hearts
            "zayden.dialogue.4hearts_1": "",
            "zayden.dialogue.4hearts_2": "",
            "zayden.dialogue.4hearts_3": "",
            "zayden.dialogue.4hearts_4": "",
            "zayden.dialogue.4hearts_5": "",
            "zayden.dialogue.4hearts_6": "",
            "zayden.dialogue.4hearts_7": "",
        //6 Hearts
            "zayden.dialogue.6hearts_1": "",
            "zayden.dialogue.6hearts_2": "",
            "zayden.dialogue.6hearts_3": "",
            "zayden.dialogue.6hearts_4": "",
            "zayden.dialogue.6hearts_5": "",
            "zayden.dialogue.6hearts_6": "",
            "zayden.dialogue.6hearts_7": "",
        //8 Hearts
            "zayden.dialogue.8hearts_1": "",
            "zayden.dialogue.8hearts_2": "",
            "zayden.dialogue.8hearts_3": "",
            "zayden.dialogue.8hearts_4": "",
            "zayden.dialogue.8hearts_5": "",
            "zayden.dialogue.8hearts_6": "",
            "zayden.dialogue.8hearts_7": "",
        //10 Hearts
            "zayden.dialogue.10hearts_1": "",
            "zayden.dialogue.10hearts_2": "",
            "zayden.dialogue.10hearts_3": "",
            "zayden.dialogue.10hearts_4": "",
            "zayden.dialogue.10hearts_5": "",
            "zayden.dialogue.10hearts_6": "",
            "zayden.dialogue.10hearts_7": "",
}