{
    //Raven
        "raven.conversationTopic.introduction": "Ah, you're @! It's great to meet you, I'm Raven.#$b#I've heard word going around that we'd be seeing someone new soon.#$e#You'll find me all kinds of places, so you might have a hard time flagging me down for things.",
        "raven.conversationTopic.willyCrabs": "Gus told me that a bunch of crabs went loose at Willy's shop!#$e#I'd be too scared to even think about getting the place cleaned up.#$b#At that point, the shop is theirs.",
        "raven.conversationTopic.pamHouseUpgrade": "I think you did a really sweet thing having Pam's trailer turned into a house.#$e#It must take a lot for Pam to swallow her pride, but it's something that they've needed for a long time.",
        "raven.conversationTopic.pamHouseUpgradeAnonymous": "I don't know who got Pam's trailer turned into a house, but whoever did it must've really cared.#$e#It's nice to see people investing in the community.",
        "raven.conversationTopic.joja_Begin": "I know that the community center is gonna be taken over by Joja, but Mayor Lewis could've paid to get it restored if he actually cared about it.$2#$e#I know that man's secrets. He has the money for it, but hoped to get someone to volunteer to get it done.#$b#What a lazy hack of a mayor.",
        "raven.conversationTopic.movieTheater": "I'm surprised that Pelican Town is getting it's own movie theater! It'll be a ton of fun.#$e#Is it sad to say that I've only been to the movies once in my life?",

        "raven.conversationTopic.dumpsterDiveComment_1": "Did you find anything good in there?#$b#If you find anything useful that you don't want, let me know!",
        "raven.conversationTopic.dumpsterDiveComment_2": "Don't let anything go to waste if you know you it can be used!",
        "raven.conversationTopic.dumpsterDiveComment_3": "Hey, @, if you see any food in there, could you split it with me.#$b#Y-you don't have to though!",
        "raven.conversationTopic.dumpsterDiveComment_4": "Did you come across any algae?#$b#I wonder how people find algae in town. Isn't it a weird place to see it?",
        "raven.conversationTopic.dumpsterDiveComment_5": "Just a little advice, you might not wanna be too loud or obvious with dumpster diving.#$b#They WILL look at you weird for it. I just don't want them to judge you, you know?#$b#You're doing great though, I don't mind it.",
        "raven.conversationTopic.dumpsterDiveComment_6": "Do you ever wonder why some people throw perfectly good food away?#$b#It's like humans are incapable of eating leftovers. Leftovers aren't even bad!#$b#I feel like those kinds of people are spoiled.",
        "raven.conversationTopic.dumpsterDiveComment_7": "If you come across soggy newspaper, save it so you can recycle it later.#$b#Sometimes you get some cool stuff in return!",
        "raven.conversationTopic.dumpsterDiveComment_8": "How come the people never toss their old clothes in the trash?#$b#We don't have a thrift store in Pelican Town. Maybe they mail it out to thrift stores in Zuzu or something.",
        "raven.conversationTopic.dumpsterDiveComment_9": "Find anything weird in the trash?",
        "raven.conversationTopic.dumpsterDiveComment_10": "Oooh, that looks cool!",

        "raven.conversationTopic.hitBySlingshot_1": "What the fuck is wrong with you?! Don't do that!#$e#%Raven is glaring at you. It feels like a threat.",
        "raven.conversationTopic.hitBySlingshot_2": "Who did that?!#$b#Wait, @! You know better than to do this! You're a grown adult.#$b#I swear to Yoba... *mutters angrily to themself*#$e#%Raven refuses to speak to you. Maybe you messed up.",
        "raven.conversationTopic.hitBySlingshot_3": "!!!#$b#Were it not for the laws of this land I-#$b#...#$b#Just screw you!#$e#%Raven looks close to fighting you. Maybe you should leave them alone.",
        "raven.conversationTopic.hitBySlingshot_4": "You little shit, get out of here!#$e#%Raven refuses to look at you.",
        "raven.conversationTopic.hitBySlingshot_5": "Do you want me to tell Mayor Lewis about this?!#$b#I'm sure he could get your ass kicked out of here if you keep this shit up!",
        "raven.conversationTopic.hitBySlingshot_6": "%Raven's eye twitches.#$b#What the fuck did you just do to me you little shit?#$b#I'll have you know I graduated top of my class in the Ferngill Navy and I've been involved in numerous secret raids on top secret groups.#$b#AND I have over 300 confirmed kills.#$b#I am trained in geurilla warfare and I'm the top sniper in the entire armed forces.#$b#You are nothing to me but just another target.#$e#I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth. Mark my fucking words.#$b#You think you can get away with saying that shit to me to my fucking face? Think again, fucker.#$e#As we speak, I am contacting my secret network of spies across the Ferngill Republic and you're being traced right now.#$b#So you better prepare for the storm, maggot.#$b#The storm that wipes out the pathetic little thing you call your life.#$e#You're fucking dead, kid.#$b#I can be anywhere, anytime, and I can kill you in over seven hundred ways.#$b#And that's just with my bare hands.#$e#Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the military.#$b#I will use it to its full extent to wipe your miserable ass off the face of the continent.#$b#You little shit.#$e#If only you could have known what unholy retribution your little clever comment was about to bring upon you.#$b#Maybe you would have held your fucking tongue. But you couldn't. You didn't.#$b#And now your're paying the price, you goddamn idiot.#$e#I will shit fury all over you and you will drown in it.#$b#You're fucking dead, kiddo.#$e#*sigh* Okay, maybe that stuff isn't true, but still. Don't do that to people. It's rude.",
        "raven.conversationTopic.hitBySlingshot_7": "I...#$b#I HATE YOU, THAT HURT!#$e#Don't apologize. Get away from me!",
        "raven.conversationTopic.hitBySlingshot_8": "AAAAAAAA#$b#AAAAAAAAA#$b#AAAAAAAAAAAGH!#$e#Screw you!!!",
        "raven.conversationTopic.hitBySlingshot_9": "How would you like it if I hit you with a fucking slingshot?!#$b#You wouldn't like it, would you?!",
        "raven.conversationTopic.hitBySlingshot_10": "I hope you get hit with a ton of rocks you asshat!",

        "raven.conversationTopic.communityCenter.begin": "It seems like there's some activity going on in the Community Center.#$e#Is Mayor Lewis finally getting his shit together and resotring it?#$b#Wait, you're restoring it?#$b#Well, hopefully you aren't mad about not getting compensated for your labor.",
        "raven.conversationTopic.communityCenter.complete": "The fact the Community Center got repaired is a miracle! You did a great job.#$e#You should get paid for the work you did though. I'll try and talk to Mayor Lewis about it.",
        "raven.conversationTopic.communityCenter.boulder": "Have you noticed that boulder near the mines finally dislodged? Now we can go panning for materials!#$e#We live in a really convenient area.#$b#For one, panning for materials isn't something most people can brag about doing from their backyard.",
        "raven.conversationTopic.communityCenter.bridge": "Did Robin work on a construction project overnight? The bridge past the mines got repaired.#$e#I kinda wonder what's over there.",
        "raven.conversationTopic.communityCenter.bus": "Shoot, I didn't even know the bus was getting repaired! Now I can travel out of town for once.#$e#I just hope the bus fare doesn't make me go broke too fast.",
        "raven.conversationTopic.communityCenter.greenhouse": "I heard you have a greenhouse now! Now it'll be much easier to grow crops year-round.#$e#I wonder how hard it is to grow things in a greenhouse actually.#$b#It'd be cool to use one I think.",
        "raven.conversationTopic.communityCenter.minecart": "I saw some critters in the middle of the night swarming some of the Minecarts last night.#$e#I wonder what that's all about.",

        "raven.conversationTopic.won.eggHunt": "Hey, congrats on winning the egg hunt!$1#$b#It can be pretty challenging with Abigail and Sophia playing, but I'm glad you got to win.",
        "raven.conversationTopic.won.grangeDisplay": "Wow, your grange display looked amazing!$1#$b#You definitely deserved to win the grange display contest this year.",
        "raven.conversationTopic.won.iceFishing": "How much practice did you do for the ice fishing contest? You did amazing!$1",

        "raven.conversationTopic.gotPet.cat": "Oh, you ended up adopting the cat Penny and I caught? That's amazing!$1#$b#Hopefully you both bond well.",
        "raven.conversationTopic.gotPet.other": "Oh, you ended up adopting a pet? That must be awesome!$1#$b#Hopefully you both bond well.",
        "raven.conversationTopic.farmerMarried": "Congrats on getting married, @! I hope married life treats you well.$1#$action AddMail Current {{Raven}}_marriageTalk received",
        "raven.conversationTopic.farmerDivorced": "I'm sorry your marriage didn't end up how you expected it to.$2#$b#If you need any emotional support, I'm here for you.",
    //Zayden
        "zayden.conversationTopic.Introduction": "Oh, you're @! Did you get the letter I sent you? I wrote it while I was still out of town.#$b#Gus and I are pretty close so he always lets me know about new things that happen.#$e#I hope you like it here.",
        "zayden.conversationTopic.pamHouseUpgrade": "I heard that you helped Pam and Penny get a house. You're pretty selfless for that.#$b#Th-that's a good thing!$10",
        "zayden.conversationTopic.pamHouseUpgradeAnonymous": "I wonder who helped Pam and Penny get a house.#$b#That couldn't have been cheap.$4",
        "zayden.conversationTopic.joja_Begin": "It's about time the Community Center gets dealt with. Mayor Lewis clearly had no plans to keep it in usable condition.$2",
        "zayden.conversationTopic.movieTheater": "Now we have something interesting to do in town.#$b#It'll give me more things to do at least.",
        "zayden.conversationTopic.dumpsterDive": "...$4",
        "zayden.conversationTopic.hitSlingshot": "Don't shoot me with your damn slingshot!$5#$e#Don't talk to me right now.$8",
        "zayden.conversationTopic.cc_Minecart": "The minecarts are working again...#$b#Do you think Clint secretly worked on them?$9",
        "zayden.conversationTopic.cc_Greenhouse": "You have a greenhouse now?#$b#Now that I think about it, I have some seeds that I can give you. You'll get it in the mail, so keep an eye out for it.",
        "zayden.conversationTopic.cc_Bus": "It's good that the bus is fixed. Now I can see my doctor that's out of town.#$e#Why's my doctor out of town? She's a specialist since I have particular health needs that most doctors aren't experienced with.",
        "zayden.conversationTopic.cc_Bridge": "The bridge got fixed?#$b#...#$b#What bridge?$4#$e#Oh, the bridge by the Adventurer's Guild? I never go that far into the mountains so I didn't notice.",
        "zayden.conversationTopic.cc_Boulder": "Have you noticed the shiny stuff in the water? I think it's because of the boulder that vanished last night.#$b#There's no way it's a coincidence.",
        "zayden.conversationTopic.cc_Complete": "I'm surprised the Community Center is fixed up.#$b#W-wait, YOU restored the Community Center?#$b#*whispers* Dear Yoba, I look like an idiot... $4#$e#Y-you did a good job with the Community Center.#$b#*whispers* Mayor Lewis should've paid you for the work, though.",
        "zayden.conversationTopic.wonEggHunt": "Hey @, congrats on winning the egg hunt. It's pretty hard with Abigail out there. She's got a sharp eye.",
        "zayden.conversationTopic.wonGrange": "You did really good with your grange display this year.#$b#To be honest, I love when anyone wins against Pierre.$1",
        "zayden.conversationTopic.wonIceFishing": "Good job with the ice fishing!#$b#I'd love to try it, but I'm so bad at fishing.$4",
        "zayden.conversationTopic.married_farmer": "Hey, @, congrats on getting married. I really hope you and your spouse have a good future.",
        "zayden.conversationTopic.divorced_farmer": "... I heard that you got divorced. I've never done marriage before, but I hope it gets easier for you sooner rather than later.$4#$e#*whispers* I hope I said the right thing.$4",
}