{
    //{{RavenMedicationPickupDialogue}}
        //Spring, Summer, Fall
            "raven.dialogue.medicationPickup.dayOf_1": "I gotta pick up my meds today at the clinic.#$e#Too bad they taste so horrible.$2",
            "raven.dialogue.medicationPickup.dayOf_2": "I pick up my meds the same day of every month. It's harder to lose track that way.#$e#It also helps me remember my birthday when I have something important to do on that day.",
        //Winter
            "raven.dialogue.medicationPickup.birthday.dayOf_1": "It's my birthday today!$3#$e#Happy birthday to me~! Happy birthday to me~!$1",
            "raven.dialogue.medicationPickup.birthday.dayOf_2": "Today's my birthday!$3#$b#My medication pickup is also scheduled for today, but that's not as important.$1",
    //Generic (Tue, Sun)
        "raven.dialogue.generic_1": "I don't think I drank enough water yesterday. I have a massive headache right now.$2",
        "raven.dialogue.generic_2": "%Raven says nothing but nods their head at you with a big smile.#$b#!$1",
        "raven.dialogue.generic_3": "I wonder what Mayor Lewis actually does as mayor.#$e#There's never any new ordinances for this place. It's pretty static here to be honest.#$b#I feel like he could be doing more to improve the community.",
        "raven.dialogue.generic_4": "I hope you have time to relax every once in a while!$1#$e#It's good to not push yourself too hard.",
        "raven.dialogue.generic_5": "Sorry, I'm not really in the mood to talk to people today.$2#$b#It's not you. I'm just having a rough time.$2",
        "raven.dialogue.generic_6": "%Raven says nothing but has a sad look on their face.#$b#...$2",
        "raven.dialogue.generic_7": "%Raven waves at you.#$b#!$1",
        "raven.dialogue.generic_8": "Please don't take it personally if I don't speak to you verbally sometimes.#$b#I have moments where I struggle to speak sometimes.$11",
        "raven.dialogue.generic_9": "If I have time, maybe I could play some video games today.$1",
        "raven.dialogue.generic_10": "My feet are really sore today. I should take it easy.$2",
        "raven.dialogue.generic_11": "I need to wash my laundry soon. It's starting to pile up again.$2",
        "raven.dialogue.generic_12": "I swear I forgot something...$17#$e#This always happens.$2",
    //Seasonal Generic
        //Spring
            "raven.dialogue.spring.generic_1": "I really enjoy how the weather is during spring!$1#$b#I do kind of miss winter though.$2",
            "raven.dialogue.spring.generic_2": "My eyes are super itchy. I hate seasonal allergies.$2",
            "raven.dialogue.spring.generic_3": "...$16#$b#Oh, I'm just enjoying the weather right now. It's really peaceful.",
            "raven.dialogue.spring.generic_4": "With the flowers in bloom, the air smells wonderful!$1#$e#Do you have a favorite flower? My favorite are marigolds.",
            "raven.dialogue.spring.generic_5": "The scenery is so colorful during spring. It's perfect for art inspiration!$1",
            "raven.dialogue.spring.generic_6": "Sorry, my seasonal allergies are giving me a major headache right now. Maybe we can talk later?$2",
            "raven.dialogue.spring.generic_7": "It's odd how I can appreciate the beauty of spring even though my seasonal allergies are making me suffer.",
        //Summer
            "raven.dialogue.summer.generic_1": "Ugh it's so hot!$2#$b#If only it was winter. Then I wouldn't have to worry about trying to cool down all the time.$2",
            "raven.dialogue.summer.generic_2": "Dear Yoba it's so hot! I wish it was any season BUT summer.$2",
            "raven.dialogue.summer.generic_3": "It'd be awesome if we had a community pool! It'd be super handy.#$b#... Okay, but swimming at the beach means sand will be in my hair for weeks.$2",
            "raven.dialogue.summer.generic_4": "I hate to admit that I sometimes enjoy the summer heat.$11#$b#I think it's because being directly in the sun makes my skin feel funny after a while.$1",
            "raven.dialogue.summer.generic_5": "It'd be awesome if there were swimming competitions during the summer.$3#$b#I'm sure plenty of people would participate!$1",
            "raven.dialogue.summer.generic_6": "Yup, I'm super sweaty today.$2#$b#At least I can go to the beach to rinse off!$1",
            "raven.dialogue.summer.generic_7": "I can only imagine how hot it is over in Calico Desert right now.$2#$b#Wait, I think imagining it is actually making me feel hotter.$12",
        //Fall
            "raven.dialogue.fall.generic_1": "I love feeling the leaves crunch under my feet!$1",
            "raven.dialogue.fall.generic_2": "%Raven stomps hard on the leaves as they walk.#$e#Crunch! Crunch! Crunch!$3",
            "raven.dialogue.fall.generic_3": "Since fall is normally the season people make wine, I wonder how much is being made right now.$17#$b#I just hope it tastes good!$1",
            "raven.dialogue.fall.generic_4": "I love how it's not too cold outside today.#$b#It's much better than summer was!$1",
            "raven.dialogue.fall.generic_5": "If the season of fall was a person, I think we'd be best friends!$1#$b#I connect with nature a lot better during this time of year.",
            "raven.dialogue.fall.generic_6": "Imagine if instead of water raining from the sky during the fall, it was leaves falling from the sky?$3#$b#I think it'd be nature littering on itself if that were to happen, though.",
            "raven.dialogue.fall.generic_7": "If you have an extra pumpkin lying around, I could definitely use one.#$b#I love making Jack-o-lanterns!$1",
        //Winter
            "raven.dialogue.winter.generic_1": "I love how cold it is today! It feels just right.$1",
            "raven.dialogue.winter.generic_2": "It's s-so cold t-today.$2#$e#%Raven is shivering a lot.",
            "raven.dialogue.winter.generic_3": "I ate a bit of snow this morning.#$b#It tastes pretty good!$1#$e#Yes, I avoid snow that's not an... unnatural color.$2#$b#I wouldn't ever wanna touch discolored snow.$11",
            "raven.dialogue.winter.generic_4": "I don't know why, but the sound of snow falling on top of my tent is annoying.#$b#I never feel that way about rain though.$17",
            "raven.dialogue.winter.generic_5": "Be sure to stay warm! I wouldn't want you to freeze into a popsicle.",
            "raven.dialogue.winter.generic_6": "I might build a snowperson today...$17#$b#I'm still deciding.",
            "raven.dialogue.winter.generic_7": "What's something you enjoy about winter?#$b#I always get curious abouut that kind of thing.$1#$e#That's pretty neat!$1",
    //Festivals
        //Egg Festival
            "raven.dialogue.eggFestival.dayBefore_1": "Are you ready for the Egg Festival tomorrow?$3#$e#I won't join the egg hunt. I have more fun watching people frantically hunt for eggs!$1",
            "raven.dialogue.eggFestival.dayBefore_2": "Mayor Lewis wanted me to remind you about the Egg Festival in case you forgot to check your mail.$1#$e#There's no pressure for you to participate though.#$b#You're an adult. Live your best life!",
            "raven.dialogue.eggFestival.dayBefore_3": "It might be a little silly but I'm not feeling the Egg Festival vibe this year.$11#$e#Maybe Harvey needs to adjust my medication dosage or something...$17#$b#Don't mind me. I'm just thinking out loud.$11",
            "raven.dialogue.eggFestival.dayBefore_4": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at the Egg Festival.$11",

            "raven.dialogue.eggFestival.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Egg Festival is happening today.$1#$e#I can't wait for the Egg Festival to start! It's gonna be so much fun.$1",
            "raven.dialogue.eggFestival.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Egg Festival is happening today.$1#$e#I would help set up the festival but I usually just end up getting in the way.$11#$b#It's more effort for people to explain how to get things done to me. It's better if I just stay off to the side during the setup.$12",
            "raven.dialogue.eggFestival.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Egg Festival is happening today.$1#$e#Imagine if people gave gifts during the Egg Festival!$1#$e#Would the gift theme just be anything related to eggs? Now I gotta think about it.$17",
            "raven.dialogue.eggFestival.dayOf_4": "Good morning, @! Mayor Lewis wanted me to remind you that the Egg Festival is happening today.$1#$e#Are you gonna come to the Egg Festival today? It'd be awesome if you joined us!$1#$b#I completely understand if you're too busy though.",

            "raven.dialogue.eggFestival.dayAfter_1": "The Egg festival was a ton of fun! I hope you managed to take a plate of food home with you.$1#$e#",
            "raven.dialogue.eggFestival.dayAfter_2": "Those deviled eggs were so good! I gotta try to convince Gus to sell them at the Saloon.$1#$e#He might need an egg supplier for that though.$17",
            "raven.dialogue.eggFestival.dayAfter_3": "The festival was pretty exhausting yesterday.$2#$e#I think I just got overwhelmed by being around people for so long.$11#$b#I actually have a limited social battery. I know it's pretty strange for someone like me.$11",
            "raven.dialogue.eggFestival.dayAfter_4": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at tomorrow's festival.$11",
            "raven.dialogue.eggFestival.dayAfter_5": "I think I used my legs way too much yesterday! My legs are hurting so bad right now.$2#$e#I'll definitely need to take it easy today.$11",
        //Flower Dance
            "raven.dialogue.flowerDance.dayBefore_1": "No one has asked me to the Flower Dance but I still practice every year just in case.$1",
            "raven.dialogue.flowerDance.dayBefore_2": "Some people find the Flower Dance to be romantic so asking someone to dance is similar to asking them on a date.#$e#I don't think like that though.$1#$b#If you wanna dance with the homie then dance with the homie!$1",
            "raven.dialogue.flowerDance.dayBefore_3": "I wanna fast-forward time so the Flower Dance can start finally!$3#$e#I wanna see a performance, not stand here all day.$17",
            "raven.dialogue.flowerDance.dayBefore_4": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at the Flower Dance.$11",
            "raven.dialogue.flowerDance.dayBefore_5": "How cool would it be if someone had their wedding during the Flower Dance?$6#$e#I feel like it would be super symbolic and romantic.$4",

            "raven.dialogue.flowerDance.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#I can't wait to see the Flower Dance this year! Everyone dances so well.$3",
            "raven.dialogue.flowerDance.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#I wonder if anyone will ask to dance with me this year.$1#$b#It probably won't happen. I don't talk to people enough for that to happen.$11",
            "raven.dialogue.flowerDance.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#I bet the food at the Flower Dance is gonna taste good! Gus never lets us down when it comes to catering.$1",
            "raven.dialogue.flowerDance.dayOf_4": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#I wonder what I'm gonna wear to the Flower Dance today...$16",

            "raven.dialogue.flowerDance.dayAfter_1": "I'm pretty tired from the dance yesterday, but it was so much fun!$1",
            "raven.dialogue.flowerDance.dayAfter_2": "I wonder who came up with the flower dance in the first place.$17#$b#The movements are very graceful.$1",
            "raven.dialogue.flowerDance.dayAfter_3": "I wonder how many people are exhausted from the Flower Dance.$17#$b#I always get curious about that kind of thing.",
        //Luau
            "raven.dialogue.luau.dayBefore_1": "I wonder what everyone's bringing the Luau tomorrow!$1#$e#I'm just looking forward to whatever Gus makes. You gotta have some!$3",
            "raven.dialogue.luau.dayBefore_2": "Hopefully it's not too hot this year at the Luau.$2#$e#Listen. We don't need Harvey to work on his day off because of heat-related illnesses.$2",
            "raven.dialogue.luau.dayBefore_3": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at the Luau.$11",

            "raven.dialogue.luau.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#Call me crazy but I'm pretty sure I can smell the food from here!$3#$e#You better grab some food from the Luau before I get there. When I see that food... it's on SIGHT.$1",
            "raven.dialogue.luau.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#I wonder if the governor is gonna like the soup at the Luau this year.$17#$b#I bet it'd be REALLY bad if he didn't like the soup.$12",
            "raven.dialogue.luau.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Flower Dance is happening today.$1#$e#It's kinda weird to have the governor come by for the Luau every year.$17#$b#I dunno... It just seems odd.$17",

            "raven.dialogue.luau.dayAfter_1": "Ugh... I'm nauseous... I ate too much food at the Luau.$2#$e#I should've listened to Gus when he told me to slow down.$12",
            "raven.dialogue.luau.dayAfter_2": "The food was absolutely amazing at the Luau yesterday!$1#$e#I wish there was leftovers.$2",
            "raven.dialogue.luau.dayAfter_3": "I'm lowkey glad that the governor is gone. It's stressful having authority like him hang around.$2#$e#It's not my fault that I find authority intimidating.$17",
        //Moonlight Jellies
            "raven.dialogue.moonlightJellies.dayBefore_1": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at tomorrow's festival.$11",
            "raven.dialogue.moonlightJellies.dayBefore_2": "I heard the Dance of the Moonlight Jellies is tomorrow! I hope you come watch.$3#$e#It's so beautiful. I wish we could see it happen more than once a year.$1",
            "raven.dialogue.moonlightJellies.dayBefore_3": "I love going to the Dance of the Moonlight Jellies! Seeing all those colors in the water looks so magical.$1#$e#I hope you decide to go to the festival tomorrow. I promise you'll love it!",

            "raven.dialogue.moonlightJellies.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Dance of the Moonlight Jellies is happening tonight.$1#$e#I can't wait to see the Moonlight Jellies tonight! It's gonna be stunning, I know it.$1",
            "raven.dialogue.moonlightJellies.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Dance of the Moonlight Jellies is happening tonight.$1#$e#I wonder how many Moonlight Jellies there are in the world. I bet it's a ton!$3",
            "raven.dialogue.moonlightJellies.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Dance of the Moonlight Jellies is happening tonight.$1#$e#I wonder if anyone is bringing food to the event.$17",

            "raven.dialogue.moonlightJellies.dayAfter_1": "I think I stayed up too late last night. I'm so drowsy.$2",
            "raven.dialogue.moonlightJellies.dayAfter_2": "There were so many moonlight jellies last night! They were so cool to see in person!$3",
            "raven.dialogue.moonlightJellies.dayAfter_3": "I love how the weather yesterday was perfect to enjoy watching the moonlight jellies swim by.",
        //Stardew Valley Fair
            "raven.dialogue.stardewValleyFair.dayBefore_1": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at tomorrow's festival.$11",
            "raven.dialogue.stardewValleyFair.dayBefore_2": "Since the Stardew Valley Fair is tomorrow, I wonder what everyone likes about it.#$e#I know that some people only go to the fair to see the grange displays.#$b#Personally, I go for the carnival games! The fishing one is a blast!$3",
            "raven.dialogue.stardewValleyFair.dayBefore_3": "I wonder who's gonna enter the grange display contest at the fair tomorrow.$1",

            "raven.dialogue.stardewValleyFair.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Stardew Valley Fair is happening today.$1#$e#I know that I'll be going to the fair!$1#$b#If you decide to go, are you gonna focus on the carnival games or the grange displays?",
            "raven.dialogue.stardewValleyFair.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Stardew Valley Fair is happening today.$1#$e#I wonder who's gonna win the grange display contest this year.$3#$e#I guess we'll see!$1",
            "raven.dialogue.stardewValleyFair.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Stardew Valley Fair is happening today.$1#$e#Once the fair is over, then everyone will be focusing on Spirit's Eve!$3",

            "raven.dialogue.stardewValleyFair.dayAfter_1": "I used up a lot of my energy yesterday, but I'm all good!$1#$e#I spent a lot of time at the fishing game.#$b#The guy running the booth probably got confused about me being there for over an hour straight.$11",
            "raven.dialogue.stardewValleyFair.dayAfter_2": "The grange displays were really amazing this year!$1#$b#I bet next year will be even better$3",
            "raven.dialogue.stardewValleyFair.dayAfter_3": "I wonder how long it took for everyone to pack up when the festival ended.$17#$b#The clown probably was the first to leave since they didn't have many props.",
        //Spirits Eve
            "raven.dialogue.spiritsEve.dayBefore_1": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at tomorrow's festival.$11",
            "raven.dialogue.spiritsEve.dayBefore_2": "I have a big collection of costumes for Spirit's Eve.#$e#I bet you can't guess what I'll wear tomorrow.$1",
            "raven.dialogue.spiritsEve.dayBefore_3": "Spirit's Eve is tomorrow! I'm always excited for it.$1#$e#It's always fun embracing the spookier parts of life, you know?",

            "raven.dialogue.spiritsEve.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that Spirit's Eve is happening tonight.$1#$e#I wonder what people are bringing for Spirit's Eve.#$b#Or is Gus the one catering everything?#$b#No one tells me these things.$11",
            "raven.dialogue.spiritsEve.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that Spirit's Eve is happening tonight.$1#$e#It's Spirit's Eve! It's Spirit's Eve!$3",
            "raven.dialogue.spiritsEve.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that Spirit's Eve is happening tonight.$1#$e#I wonder who's gonna wear costumes this year...",

            "raven.dialogue.spiritsEve.dayAfter_1": "I definitely stayed up too late last night. I'm all kinds of drowsy right now.$2",
            "raven.dialogue.spiritsEve.dayAfter_2": "Damn, that food was so good! I'm glad I didn't skip Spirit's Eve this year.$1",
            "raven.dialogue.spiritsEve.dayAfter_3": "I'm so full from last night's food, but it was totally worth it.$1",
        //Festival of Ice
            "raven.dialogue.festivalOfIce.dayBefore_1": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at tomorrow's festival.$11",
            "raven.dialogue.festivalOfIce.dayBefore_2": "It'd be cool if Mayor Lewis had a snowperson competition at the Ice Festival! I'd try to make something super cool.$3#$e#I'd probaby make something cursed.$1#$b#Like a monster that only has two legs, a torso, and a head with one eye!$3",
            "raven.dialogue.festivalOfIce.dayBefore_3": "Maybe one of these days I'll do the ice fishing competition at the Ice Festival.#$e#I'll need a fishing pole, though.$2",

            "raven.dialogue.festivalOfIce.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Ice Festival is happening today.$1#$e#The weather is perfect for the Ice Festival!$1",
            "raven.dialogue.festivalOfIce.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Ice Festival is happening today.$1#$e#I wonder who's gonna win the fishing competition this year!$1",
            "raven.dialogue.festivalOfIce.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Ice Festival is happening today.$1#$e#I'll be busy building snowpeople at the festival.#$b#I wonder what they're gonna look like.$1",

            "raven.dialogue.festivalOfIce.dayAfter_1": "The Ice Festival was so much fun!$1#$b#Did you enjoy it?",
            "raven.dialogue.festivalOfIce.dayAfter_2": "I wish the Ice Festival lasted longer.$2#$e#Oh well, it was fun!$1",
            "raven.dialogue.festivalOfIce.dayAfter_3": "I got some compliments on the snowpeople I made yesterday!$1#$b#It's a pretty big achievement for me.",
        //Feast of the Winter Star
            "raven.dialogue.feastOfTheWinterStar.dayBefore_1": "It's kinda funny how there's never any rain during festivals.$1#$e#Let's just hope we don't get random rain at tomorrow's festival.$11",
            "raven.dialogue.feastOfTheWinterStar.dayBefore_2": "I wonder what everyone's getting for the Winter Star.#$e#I wonder who my secret gift-giver is.$1",
            "raven.dialogue.feastOfTheWinterStar.dayBefore_3": "I can't wait to see everyone at the festival tomorrow.$3#$b#I miss hanging out with the people in town.$2",

            "raven.dialogue.feastOfTheWinterStar.dayOf_1": "Good morning, @! Mayor Lewis wanted me to remind you that the Feast of the Winter Star is happening today.$1#$e#I can't wait to see everyone today.$1",
            "raven.dialogue.feastOfTheWinterStar.dayOf_2": "Good morning, @! Mayor Lewis wanted me to remind you that the Feast of the Winter Star is happening today.$1#$e#I wonder what food is gonna be there this year.$3",
            "raven.dialogue.feastOfTheWinterStar.dayOf_3": "Good morning, @! Mayor Lewis wanted me to remind you that the Feast of the Winter Star is happening today.$1#$e#I wonder who my secret gift-giver is!$3",

            "raven.dialogue.feastOfTheWinterStar.dayAfter_1": "It was great spending time with everyone yesterday.#$e#Everyone got really cool presents too!$1",
            "raven.dialogue.feastOfTheWinterStar.dayAfter_2": "I think I spent too much time at the festival.$2#$b#I got really worn out from talking to everyone.$11",
            "raven.dialogue.feastOfTheWinterStar.dayAfter_3": "The food was so good this year!$1#$b#Luckily there was enough leftovers for me to bring some home.",
        
        //Plain Seasons -> Very unlikely to appear in-game
            "raven.dialogue.spring": "Spring rarely ever brings down my mood. What about you?",
            "raven.dialogue.summer": "Summer doesn't really seem to end fast enough, does it?",
            "raven.dialogue.fall": "Fall is pretty cozy! I just wish it'd last a little longer, you know?",
            "raven.dialogue.winter": "Winter... It's... so... cold...",

        //Weather Dialogue
            //Green Rain
                //Year 1
                    "raven.dialogue.greenRain.year1": "Do you think it's safe to drink the water from green rain?#$e#Maybe I can test it out!#$b#...#$b#Hm... It tastes odd. Not bad, but it's too hard to describe.",
                    "raven.dialogue.greenRain.after.year1": "No one died from the rain, so that's good!#$b#What? I thought it might've been caused by pollution or something.",
                //Year 2
                    "raven.dialogue.greenRain.year2": "This green rain smells amazing!#$e#I wonder if people will find a way to turn this into a candle scent.",
                    "raven.dialogue.greenRain.after.year2": "Two years in a row of this rain is kinda weird, but I'm not bothered by it.",
                //Year 3+
                    "raven.dialogue.greenRain.year3_1": "One thing I hate about green rain is how much moss there is.#$e#It's a texture thing, blame the autism.",
                    "raven.dialogue.greenRain.year3_2": "I wonder what makes the rain green.#$e#I could probably ask Demetrius. He's really good at that stuff.",
                    "raven.dialogue.greenRain.year3_3": "I'm not sure if you noticed it, but does the green rain feel different from normal rain?#$e#I could be just imagining things, but it definitely feels different to me.",
                    "raven.dialogue.greenRain.year3_4": "I figured that I would gather some moss today. There's so much right now!",
                    "raven.dialogue.greenRain.year3_5": "I noticed something really strange. How come some trees and weeds either change or vanish overnight?#$e#It reminds me of a movie...#$b#The one where the guy gets eaten by a tentacle monster and everyone is in a grocery store.#$b#It's one of my childhood favorites!",
                    "raven.dialogue.greenRain.year3_6": "Do you do anything different when there's green rain?#$e#That's interesting. Well, keep doing your thing!",
                    "raven.dialogue.greenRain.year3_7": "I've never been able to climb trees, but I think it'd be fun to sit on the branches and watch the rain.#$e#I just enjoy nature a lot. It's so beautiful!",
                    "raven.dialogue.greenRain.year3_8": "*jumping in puddle* Splash! Splash! Splash!#$e#%Raven is focused on splashing in puddles.",
                    "raven.dialogue.greenRain.year3_9": "Is it just me or does the green rain feel more wet than normal rain?#$e#I should ask Demetrius about it.",
                    "raven.dialogue.greenRain.year3_10": "I wonder what it would feel like to take a bath in green rain.#$e#I'm talking, like, a bath tub full of green rain.",

                    "raven.dialogue.greenRain.after.year3_1": "A rare weather pattern that happens every year? What a joke.",
                    "raven.dialogue.greenRain.after.year3_2": "I bet Demetrius has fun researching green rain when it comes around.",
                    "raven.dialogue.greenRain.after.year3_3": "I think it took longer than usual for my clothes to dry off.#$e#How did it make my clothes more wet than normal rain?",
                    "raven.dialogue.greenRain.after.year3_4": "I wonder if there's any supernatural explanation for green rain.",
                    "raven.dialogue.greenRain.after.year3_5": "I noticed there's a 'day after' smell with green rain. I like it!",
                    "raven.dialogue.greenRain.after.year3_6": "Even though this is a 'rare weather pattern', I wonder if people found a way to profit off of it.",
                    "raven.dialogue.greenRain.after.year3_7": "Imagine if somehow the green rain managed to give us superpowers!#$e#Watch out, I might end up getting super speed and break the speed limit!#$b#Just kidding!",
                    "raven.dialogue.greenRain.after.year3_8": "I can't play my video games when there's green rain.#$e#I think the rain causes interference with tech.",
                    "raven.dialogue.greenRain.after.year3_9": "I've was able to draw in the rain since it doesn't cause damage to paper!#$b#It's cool how green rain doesn't get paper soggy!",
                    "raven.dialogue.greenRain.after.year3_10": "I think green rain is cool. I never get mad when it comes around!",
            //Rain
                "raven.query.rain": "I think I'm gonna keep a jar of water from today's rain for witchy purposes.#$b#Rain water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",

                //Spring
                    "raven.dialogue.spring.rain_1": "Ugh, it's so fucking wet!#$e#It's just not the right day for me to get soaking wet, I'm sorry.",
                    "raven.dialogue.spring.rain_2": "*jumping in puddle* Splash! Splash! Splash!#$e#%Raven is focused on splashing in puddles.",
                    "raven.dialogue.spring.rain_3": "Thank heavens it's not super hot AND rainy! We have been spared by the spring season.$1",
                    "raven.dialogue.spring.rain_4": "I think I'm gonna try to soak up as much rain as I can.$1#$b#Don't worry, I'll absorb it like a sponge.#$b#Just kidding!$1#$e#It will take a while for the rain to dry out of my fur though...$2",
                    "raven.dialogue.spring.rain_5": "Watch out for the puddles! I know some people hate stepping in them.#$e#I enjoy splashing in puddles. It's because of both the sound and also because splashing is fun!$1",
                    "raven.dialogue.spring.rain_6": "I think I'm gonna keep a jar of water from today's rain for witchy purposes.",
                //Summer
                    "raven.dialogue.summer.rain_1": "Summer rain feels really icky, I don't know how to explain it.#$e#I just need to get indoors ASAP.",
                    "raven.dialogue.summer.rain_2": "*jumping in puddle* Splash! Splash! Splash!#$e#%Raven is focused on splashing in puddles.",
                    "raven.dialogue.summer.rain_3": "$query PLAYER_HAS_SEEN_EVENT Current 27407003 # I think I'm gonna keep a jar of water from today's rain for witchy purposes. |I think I'm gonna keep a jar of water from today's rain for witchy purposes.#$b#Rain water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",
                    "raven.dialogue.summer.rain_4": "I think I'm gonna try to soak up as much rain as I can.$1#$b#Don't worry, I'll absorb it like a sponge.#$b#Just kidding!$1#$e#It will take a while for the rain to dry out of my fur though...$2",
                //Fall
                    "raven.dialogue.fall.rain_1": "Ugh, it's so fucking wet!#$e#It's just not the right day for me to get soaking wet, I'm sorry.",
                    "raven.dialogue.fall.rain_2": "*jumping in puddle* Splash! Splash! Splash!#$e#%Raven is focused on splashing in puddles.",
                    "raven.dialogue.fall.rain_3": "$query PLAYER_HAS_SEEN_EVENT Current 27407003 # I think I'm gonna keep a jar of water from today's rain for witchy purposes. |I think I'm gonna keep a jar of water from today's rain for witchy purposes.#$b#Rain water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",
                    "raven.dialogue.fall.rain_4": "It's gross having wet dead leaves stuck on you from the rain.$2",
                    "raven.dialogue.fall.rain_5": "I think I'm gonna try to soak up as much rain as I can.$1#$b#Don't worry, I'll absorb it like a sponge.#$b#Just kidding!$1#$e#It will take a while for the rain to dry out of my fur though...$2",
                //Winter
                    "raven.dialogue.winter.rain_1": "... It never rains during winter, what the hell?$17",
                    "raven.dialogue.winter.rain_2": "Did Magnus do something weird to make it rain during winter?$8#$b#This never happens!$3",
                    "raven.dialogue.winter.rain_3": "$query PLAYER_HAS_SEEN_EVENT Current 27407003 # I think I'm gonna keep a jar of water from today's rain for witchy purposes. |I think I'm gonna keep a jar of water from today's rain for witchy purposes.#$b#Rain water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",
            //Storm
                //Spring
                    "raven.dialogue.spring.storm_1": "I hate being outside when there's lightning. I don't wanna get electrocuted!$9",
                    "raven.dialogue.spring.storm_2": "Be sure to stay indoors and away from windows during storms.#$b#If lightning shatters the windows, you wanna be far enough away to where you don't get any glass shards on you.#$e#I just wanna make sure people stay safe.$11",
                    "raven.dialogue.spring.storm_3": "EEEEK!$9#$b#O-oh, sorry. I just got caught off guard.$11#$b#Sometimes, the thunder has me on edge.$2#$e#How are you doing today, though?",
                    "raven.dialogue.spring.storm_4": "Do you think people count how many thunderstrikes there are during storms?$17#$b#I wonder if there'd even be any significance with the numbers.$11",
                    "raven.dialogue.spring.storm_5": "$query PLAYER_HAS_SEEN_EVENT Current 27407003 # I think I'm gonna keep a jar of water from today's storm for witchy purposes. |I think I'm gonna keep a jar of water from today's storm for witchy purposes.#$b#Storm water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",
                //Summer
                    "raven.dialogue.summer.storm_1": "Dear Yoba, this rain is so humid! I can't wait for it to be sunny again.",
                    "raven.dialogue.summer.storm_2": "Don't mind me, I'm just trying to stay as dry as I can.",
                    "raven.dialogue.summer.storm_3": "$query PLAYER_HAS_SEEN_EVENT Current 27407003 # I think I'm gonna keep a jar of water from today's storm for witchy purposes. |I think I'm gonna keep a jar of water from today's storm for witchy purposes.#$b#Storm water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",
                //Fall
                    "raven.dialogue.fall.storm_1": "$query PLAYER_HAS_SEEN_EVENT Current 27407003 # I think I'm gonna keep a jar of water from today's storm for witchy purposes. |I think I'm gonna keep a jar of water from today's storm for witchy purposes.#$b#Storm water has a place in spellwork, trust me.$1#$b#Maybe I can teach you some stuff one of these days!$1",
                    "raven.dialogue.fall.storm_2": "Do you know how weird it feels for wet fur to raise up when lightning is nearby?$2#$b#I hate it.$4",
                    "raven.dialogue.fall.storm_3": "EEEEK!$9#$b#O-oh, sorry. I just got caught off guard.$11#$b#Sometimes, the thunder has me on edge.$2#$e#How are you doing today, though?",
            //Wind
                //Spring
                    "raven.dialogue.spring.wind_1": "Seeing the petals flying in the wind like this is so calming.$1",
                    "raven.dialogue.spring.wind_2": "Imagine having petals raining down like this during a wedding. It would be just perfect!$6",
                    "raven.dialogue.spring.wind_3": "Ow!$8#$b#Some dirt flew into my eye.$2#$e#Now I'm gonna be blinking like crazy for the next minute.$5",
                //Fall
                    "raven.dialogue.fall.wind_1": "Hold up- I think I got some dirt in my eye.$2#$b#OUCH!$8#$b#Ugh, I got it out. That hurt.$13",
                    "raven.dialogue.fall.wind_2": "Even though the wind is strong, at least it's not strong enough to make rocks fly in the wind!",
                    "raven.dialogue.fall.wind_3": "It's fun watching the wind blow the leaves around.$1",
            //Winter - Snow
                "raven.dialogue.snow_1": "Do you ever think about how lucky we are to experience snow?#$e#I could watch the snow fall all day.",
                "raven.dialogue.snow_2": "I'm super cold today, but I mean, it's snowing. What else should I expect?$11",
                "raven.dialogue.snow_3": "The snow is so pretty! I could watch the snow fall all day.$1#$e#Do you like snow?",
                "raven.dialogue.snow_4": "It's so pretty outside since it's snowing, but it's too cold for me to stay outside for too long.$2#$e#I wonder what it would be like if snow could happen while it's still warm outside.#$b#It might be a lot easier for people to tolerate!$1",
                "raven.dialogue.snow_5": "One time, I tried taking some snow home with me on a road trip back when I was younger.#$b#Unfortunately, the snow all fused together and was half-melted by the time I got back home.$11#$e#It was pretty cool seeing how long the snow managed to last, though.",
        //label:Movies Invitation/Rejection
            "raven.movie.invitation_1": "You want me to go to the movies with you? That sounds awesome!#$b#Give me a moment to get my stuff together, but I'll meet you there!",
            "raven.movie.invitation_2": "A movie? That sounds awesome! I'll meet you at the theater.",
            "raven.movie.invitation_3": "Ooo, I love movies! Let's go now so we don't miss the next showing. See you there!",
            "raven.movie.invitation_4": "I'm down to watch a movie! See you there.",
            "raven.movie.invitation_5": "I'm just imagining the popcorn right now. I bet it'll taste amazing!",

            "raven.movie.spouse.invitation_1": "You want me to go to the movies with you? That sounds awesome!#$b#Give me a moment to get my stuff together, but I'll meet you there!",
            "raven.movie.spouse.invitation_2": "Aw, is this a date? How sweet of you!#$b#I'll see you there darling.",
            "raven.movie.spouse.invitation_3": "I'd love to go to the movies!#$b#After all, you deserve a break from all the hard work you do. See you there.",
            "raven.movie.spouse.invitation_4": "Aw, how sweet. Thanks a bunch for inviting me.#$b#I'll see you at the theater honey.",
            "raven.movie.spouse.invitation_5": "Ayyy, let's go check it out! Come on, I wanna see what's playing.",

            "raven.movie.reject": "I appreciate the offer, but I'm not really interested at the moment.#$b#Maybe next time!",

            "raven.movie.reject.alreadyInvitedByAnotherPlayer_1": "I'm sorry, but I already got invited to the movies today by someone else.#$b#I appreciate the thought though! Maybe next time?",
            "raven.movie.reject.alreadyInvitedByAnotherPlayer_2": "Sorry, but I got invited by someone else. Maybe next time? I'm really sorry.",
            "raven.movie.reject.alreadyInvitedByAnotherPlayer_3": "Oh snap, someone already invited me. I totally would go if I didn't already say yes.",

            "raven.movie.reject.alreadyWatchedThisWeek_1": "I've already seen a movie this week, but I'm totally down to see one next week if you want!",
            "raven.movie.reject.alreadyWatchedThisWeek_2": "I'm not in a movie mood right now, but I appreciate you inviting me.",
            "raven.movie.reject.alreadyWatchedThisWeek_3": "Not today, @. Maybe next time? Thanks for thinking of me.",

            "raven.movie.reject.divorced_1": "... Doesn't it feel weird asking your ex-spouse out to the movies?#$b#I'm just saying, I'd feel pretty awkward if I were to ask you, you know?",
            "raven.movie.reject.divorced_2": "I don't think it's a good idea. I don't want you to accidentally fall back in love with me from hanging out again.#$b#Thanks for thinking of me though.",
            "raven.movie.reject.divorced_3": "Look, I appreciate the thought, but I don't want to. We're divorced and it'd just feel wrong.",
            "raven.movie.reject.divorced_4": "Divorces are rough, you know? I don't think I can hang out with you casually without it getting me upset.",
            "raven.movie.reject.divorced_5": "Sorry, but I'm not gonna accept a movie invite from an ex.#$b#Thanks for the thought.",

            "raven.movie.reject.notInterested_1": "Don't get me wrong, I'd love to go to the movies with you.#$b#It's just that I really don't wanna see that movie.",
            "raven.movie.reject.notInterested_2": "I'm not a fan of that movie. I appreciate you inviting me, though.",
            "raven.movie.reject.notInterested_3": "That movie isn't for me. Thanks for inviting me, though.",
        //label:Island Dialogue
            "raven.resort": "Isn't it relaxing to take a little time away from the farm?#$b#You can relax with me if you want! I'd enjoy your company.",
            "raven.resort.bar": "I think I'll have a beer.#$e#Don't forget the lime, please!",
            "raven.resort.chair": "These chairs are a little hard, but they're still nice to sit in.",
            "raven.resort.dance": "I'm having a blast! You should join in on the vibes.",
            "raven.resort.entering": "I can't wait to get to the resort!#$b#I can already feel the relaxing atmosphere.#$e#*whispers* Or I might just have an overactive imagination.",
            "raven.resort.leaving": "Too bad I don't live on the island, but I'd miss everyone in town if I moved out here.#$e#I wonder if there's a way to get dual citizenship.",
            "raven.resort.shore": "I love how the sand feels on my feet!",
            "raven.resort.towel": "It's really cozy right here. I might nap here",
            "raven.resort.umbrella": "The shade is so nice. It gives me a break from the warmth.",
            "raven.resort.wander": "The tropical air feels so nice compared to Pelican Town's.#$e#I'm probably just being silly.",
        //label:Location Entry -> "/" in dialogue separates dialogue w/ random chance to appear
            "raven.locationEntry.seedShop": "Hi Pierre!/I forgot what I came here for.../Let's see.../Ayo, any sales today?",
            "raven.locationEntry.blacksmith": "You forgot your tab!",
            "raven.locationEntry.animalShop": "Hi Marnie!/Hi, I'm just stopping by to say hi.",
            "raven.locationEntry.beach": "I love how the air feels./I'm gonna get sand in my shoes.../Time to look for shells!",
            "raven.locationEntry.hospital": "Hi, I have a checkup scheduled.",
            "raven.locationEntry.movieTheater": "The popcorn smells SO good!/So many flashing lights...",
            "raven.locationEntry.saloon": "Hi Gus!/Should I get spaghetti again?",
            "raven.locationEntry.trailer": "Ayo!",
            "raven.locationEntry.trailerBig": "Ayo!/I love how much space there is in here!",
            "raven.locationEntry.wizardHouse": "Hi Magnus!",
        //label:Dating
            //bullet:Breakup -> Gifted Wilted Flowers
                "raven.gift.wiltedFlowers": "O-oh...#$b#%Raven averts their eyes.#$b#If it'll make you happy, then we should end things.",
            //bullet:Bouquet
                "raven.gift.bouquet.accept": "You want to date me?#$b#I thought I was the only one!#$b#It'd be an honor to be your partner, @.",
                "raven.gift.bouquet.reject.npcAlreadyMarried": "U-um.#$b#I'm already married... So, no.",
                "raven.gift.bouquet.reject.veryLowHearts": "Uh, I really don't know you well enough for that.#$b#*whispers* Should I file a restraining order to Mayor Lewis?",
                "raven.gift.bouquet.reject.lowHearts": "I-I think it's a little early to go asking me to date you, don't you think?",
                "raven.gift.bouquet.reject": "I don't think it's really a good time for us to date right now.",
            //bullet:Stardrop Saloon Event
                "raven.conversationTopic.dumped": "... I don't feel like talking to a cheater.$5",
                "raven.conversationTopic.secondChance": "...$5#$b#...$2#$b#Ugh... I don't wanna be mad at you... but you need to promise not to do that again, okay?$2#$b#If you wanna date other people too, just tell me first. Doing it behind my back is screwed up...$2",
        //label:Divorced
            //bullet:Dialogue
                "raven.dialogue.wipedMemory": "Hi there! It's nice to see you aga-#$b#Wait, have I met you before?#$b#Sorry, you just seem really familiar for some reason.#$e#I probably met your doppleganger at some point years ago or something.",

                "raven.dialogue.divorced_1": "I hope life is going well for you.",
                "raven.dialogue.divorced_2": "Hey, I know it's kinda weird to talk to an ex spouse and all, but you're still a chill person.#$b#Just don't expect us to be best friends or anything, okay?",
                "raven.dialogue.divorced_3": "How's the weather been for you?#$b#No, I'm being serious here.#$e#It does sound like small talk, doesn't it...",
                "raven.dialogue.divorced_4": "O-oh, hi there! You caught me off-guard there.#$b#I hope you're doing well.",
                "raven.dialogue.divorced_5": "Why do I still talk to you? What do you mean?#$b#It's not like you turned into a monster just because you divorced me.#$e#Divorce happens, and you had your reasons for it.#$b#While it wouldn't my first choice, I've accepted that we just weren't compatible.",
                "raven.dialogue.divorced_6": "Heyo, what's new with you and the farm?#$b#That's pretty interesting. Do your best and you'll do great.",
                "raven.dialogue.divorced_7": "S-sorry, I'm a little emotional at the moment. I need some space today.",
                "raven.dialogue.divorced_8": "Are you looking forward to the next festival?#$e#I always enjoy hanging out with the community.",
            //bullet:Rejections
                "raven.giftReject.divorced_1": "I'm not comfortable with accepting a gift from my ex.#$e#I hope you understand.",
                "raven.giftReject.divorced_2": "I appreciate the thought, but I'm not comfortable with receiving a gift from you.",
                "raven.giftReject.divorced_3": "No thank you, I think the divorce was a sign that maybe we shouldn't get too close again.",
                
                "raven.mermaidPendant.divorced_1": "... Why would I want to marry you again after you divorced me?",
                "raven.mermaidPendant.divorced_2": "Don't do this. I can't marry you again. It wouldn't be the same.",
                
                "raven.gift.bouquet.divorced": "...#$b#I think you forgot the fact that you chose to divorce me. I don't give second chances for things like that.",
        //label:Marriage Topics
                "raven.mermaidPendant.accepted": "Wait... You're serious?$8#$b#Of course I'll marry you @!$3#$e#You don't know how happy you made me today. I'm looking forward to the wedding, darling. Just give me a bit to make preparations.",

                "raven.engaged.day_1": "I can't believe I'm actually getting married!$6",
                "raven.engaged.day_2": "Um... honey, do you think I'll end up tripping during the ceremony?$11#$e#If I trip and fall... Would you catch me?$4",

                "raven.spouse.afterWedding": "I can't believe it... I'm married to the love of my life!$6#$e#I can't wait to see what the future holds for us, honey.$4",
            //bullet:Household
                "raven.spouse.farmhouseClutter": "@, I know that you get busy and all, but I'd appreciate if you kept the walkways clear.$2#$b#It's hard to cook when you can't get into the kitchen, you know?$2",
                "raven.spouse.monstersInHouse": "GET IT AWAY FROM ME! KILL IT! KILL IT!",
                "raven.spouse.notJealousWithGifts": "It's great seeing you get along with people around here!$1",
                "raven.spouse.stardrop": "You know, you mean a whole lot to me, so I really wanted to give you something special.#$b#The rule is that you can't ask me where I got this!",
            //bullet:Mermaid Pendant -> Rejection
                "raven.mermaidPendant.needHouseUpgrade": "I mean... I would, but there's not enough space for both of us in your home.",
                "raven.mermaidPendant.npcWithSomeoneElse": "... I'm already married to someone right now.#$b#I'm not all about that cheating lifestyle, you know?",
                "raven.mermaidPendant.playerWithSomeoneElse": "... You're married to someone else right now.#$b#I'm not a homewrecker.",
                "raven.mermaidPendant.under8hearts": "Uh, isn't it a bit soon to consider marriage?#$b#We're not even dating yet.",
                "raven.mermaidPendant.under10hearts": "I'm not ready for us to get married quite yet.#$b#Maybe give it a little more time, alright?",
                "raven.mermaidPendant.under10hearts_askedAgain": "Look, maybe you should try to get to know me just a little more before you ask me again, alright?",
                "raven.mermaidPendant": "I'm not really interested.#$b#Try to get to know me some more and just wait a while first, alright?",
        //label:Summit
            "raven.summit_1": "It was hard for me on my own.$2#$b#I struggled to be comfortable around others...$2#$e#But you were different.",
            "raven.summit_2": "... I also got to see you grow. I'm proud of all of your achievements.$4#$b#Something like that doesn't come easy, you know?$6",
}