{
    //Egg Festival
        "zayden.festival.eggFestival_1": "I kinda wish there were less people here.$9#$b#I don't like crowded places. I like the festival itself, though.",
        "zayden.festival.eggFestival_2": "I stay in the shade so I don't irritate my skin.#$e#It sucks getting heat rashes...$4",
        "zayden.festival.eggFestival_3": "Do you think people have tried cheating at egg hunts before?$9",
    //Flower Dance
        "zayden.festival.flowerDance_1": "There's hardly any shade around here. Hopefully I don't get a rash.$3",
        "zayden.festival.flowerDance_2": "The flowers smell really nice this year.$1",
    //Luau / Potluck
        "zayden.festival.luauPotluck_1": "... I have a rash from the heat...$4",
        "zayden.festival.luauPotluck_2": "Hopefully we get started soon... I might need to leave early if it takes much longer.$5",
    //Dance of the Moonlight Jellies
        "zayden.festival.moonlightJellies_1": "The jellyfish are pretty cool.#$e#It'd be nice if they came more often, though.$3",
        "zayden.festival.moonlightJellies_2": "I bet it's nice to be a jellyfish. You can just go wherever the water takes you.",
    //Stardew Valley Fair
        "zayden.festival.stardewValleyFair_1": "The weather is very nice right now.$1#$e#I plan on doing the slingshot game. I have pretty good aim!$1",
        "zayden.festival.stardewValleyFair_2": "The food is pretty good this year!$1#$e#I wish there was an ice cream truck so I could eat those ugly character popsicles.$2",
    //Spirit's Eve
        "zayden.festival.spiritsEve_1": "I do the maze with Raven every year. I get a kick out of their screams.$1#$b#Give Raven a little time and they'll get brave enough to keep going.$10",
        "zayden.festival.spiritsEve_2": "The decorations are very well done this year!$1#$e#It'd be cool if we had an area where we could watch spooky movies, you know?$7",
        "zayden.festival.spiritsEve_3": "I don't find it weird when people dress up as vampires for Spirit's Eve.#$b#I only have an issue when people dress up to make fun of vampires.$2",
    //Festival of Ice
        "zayden.festival.festivalOfIce_1": "It's so bright outside that I need to wear sunglasses.#$e#I wish the snow wasn't so reflective.$4",
        "zayden.festival.festivalOfIce_2": "I love seeing how creative everyone gets during the festival.$1",
}