{    
    // || Content.json -> ConfigSchema ||
    "config.ZaydenEnable.name": "Enable Zayden",
    "config.ZaydenEnable.description": "Choose to enable or disable Zayden from being added to the game. (Default: true)",
    
    // || Content.json -> DynamicTokens -> JojaSweep ||
    "JojaSweep_1": "JojaMart 3 7 2 l0veraven_zayden_sweep",
    "JojaSweep_2": "JojaMart 1 21 2 l0veraven_zayden_sweep",
    "JojaSweep_3": "JojaMart 5 15 2 l0veraven_zayden_sweep",
    "JojaSweep_4": "JojaMart 10 12 2 l0veraven_zayden_sweep",
    "JojaSweep_5": "JojaMart 13 15 2 l0veraven_zayden_sweep",
    "JojaSweep_6": "JojaMart 16 25 2 l0veraven_zayden_sweep",
    "JojaSweep_7": "JojaMart 18 16 2 l0veraven_zayden_sweep",
    "JojaSweep_8": "JojaMart 21 15 2 l0veraven_zayden_sweep",
    "JojaSweep_9": "JojaMart 22 12 2 l0veraven_zayden_sweep",
    "JojaSweep_10": "JojaMart 26 6 2 l0veraven_zayden_sweep",
    
    // || data/locations/Apartment.json ||
    "CJB_ZaydensApartment": "1J: Zayden",
    "warp-sections.pelican-valley-loft": "Pelican Valley Loft",
    "fridge": "The fridge is stocked with food. The cheese is low...",
    
    // || data/character.json ||
    "DisplayName": "Zayden",
    
    // || data/mail.json ||
        // {{Zayden}}_Welcome
    "WelcomeMail_title": "Welcome to Pelican Town",
    "WelcomeMail_message": "Hello there, this is Zayden.^^I'm mailing this before I come back from visiting family, but it didn't take long for me to hear about you moving in. I'm not super social, but I figured I'd still welcome you to Pelican Town.^^It's not hard to fit in here, honestly. Everyone is pretty chill as long as you don't go slingshotting people left and right. Trust me, it's a long story about an old resident. He doesn't live here anymore, so you're safe.^^Anyways, welcome to Pelican Town and I hope you enjoy your stay. Since you're starting out with farming, have some seeds. My family still gifts them to me even though I can't grow crops in my apartment. Good luck.^^- Zayden",
    "WelcomeMail_item": "%item object 476 3 %%",//3 Garlic Seeds
        // {{Zayden}}_Greenhouse
    "GreenhouseMail_title": "Greenhouse Seeds",
    "GreenhouseMail_message": "Congratulations on the greenhouse @,^^Here are the seeds I said I'd send you. It's really profitable if you know how to use it right.^^Also, don't overthink your greenhouse. It'll take time to get it how you like it.^^Good luck.^^- Zayden",
    "GreenhouseMail_item": "%item object 433 5 %%",//5 Coffee Beans
    
    // || data/dialogue/scheduleStrings.json ||
    "JojaMart_001": "...$6#$b#Oh, sorry. I'm focused on cleaning right now.#$e#...$4",
    
    // || data/dialogue/dialogue.json ||
    "0hearts_1": "I normally stay away from direct sunlight.#$b#It's not that I sunburn easily, but too much sun isn't good for my skin.$2#$e#No, I don't care that the sun causes aging.#$b#*whispers* It's kinda a dumb reason to hate the sun...$3",
    "0hearts_2": "The heat isn't an issue for me. The problem is when the sun's directly on me for too long.#$e#What happens when I'm in the sun for too long?$9#$b#I get heat rashes. It's really uncomfortable.$4",
    "0hearts_3": "I'm curious about something...#$b#$y 'Are you gonna focus on raising animals, crops, or making artisan goods?_Raising animals_That'll be pretty profitable as long as you stay consistent. You'll do fine.$7_Raising crops_I hear that once you get sprinklers all over the farm that it gets way easier from there. You've got this._Artisan goods_Listen... If you end up making cheese, can you save some for me? I'll be sure to pay you for it.$2",
    "0hearts_4": "I know I'm not super expressive. I'm just not the type to really... care about putting on a performance?$2#$b#That's what it feels like to be really expressive. It's not really authentic for me.",
    "0hearts_5": "I smell like sunscreen? Well, yeah. I wear sunscreen.#$b#*whispers* Is it bad to have sensitive skin?$4",
    "0hearts_6": "$y 'You have a question?_Are you a vampire?_Well, yeah. It's not exactly a secret.$2_Show me your fangs._... No. That's weird to ask that.$4'",
    "0hearts_7": "$y 'You have a question?_Are you allergic to garlic?_No. It actually tastes really good in spaghetti._What do you think of mirrors?_They're okay I guess. They're not all too special.'",
    
    "2hearts_1": "",
    "2hearts_2": "",
    "2hearts_3": "",
    "2hearts_4": "",
    "2hearts_5": "",
    "2hearts_6": "",
    "2hearts_7": "",
    
    "Introduction": "Oh, you're @! Did you get the letter I sent you? I wrote it while I was still out of town.#$b#Gus and I are pretty close so he always lets me know about new things that happen.#$e#I hope you like it here.",
    "pamHouseUpgrade": "I heard that you helped Pam and Penny get a house. You're pretty selfless for that.#$b#Th-that's a good thing!$10",
    "pamHouseUpgradeAnonymous": "I wonder who helped Pam and Penny get a house.#$b#That couldn't have been cheap.$4",
    "joja_Begin": "It's about time the Community Center gets dealt with. Mayor Lewis clearly had no plans to keep it in usable condition.$2",
    "movieTheater": "Now we have something interesting to do in town.#$b#It'll give me more things to do at least.",
    "dumpsterDive": "...$4",
    "hitSlingshot": "Don't shoot me with your damn slingshot!$5#$e#Don't talk to me right now.$8",
    "cc_Minecart": "The minecarts are working again...#$b#Do you think Clint secretly worked on them?$9",
    "cc_Greenhouse": "You have a greenhouse now?#$b#Now that I think about it, I have some seeds that I can give you. You'll get it in the mail, so keep an eye out for it.",
    "cc_Bus": "It's good that the bus is fixed. Now I can see my doctor that's out of town.#$e#Why's my doctor out of town? She's a specialist since I have particular health needs that most doctors aren't experienced with.",
    "cc_Bridge": "The bridge got fixed?#$b#...#$b#What bridge?$4#$e#Oh, the bridge by the Adventurer's Guild? I never go that far into the mountains so I didn't notice.",
    "cc_Boulder": "Have you noticed the shiny stuff in the water? I think it's because of the boulder that vanished last night.#$b#There's no way it's a coincidence.",
    "cc_Complete": "I'm surprised the Community Center is fixed up.#$b#W-wait, YOU restored the Community Center?#$b#*whispers* Dear Yoba, I look like an idiot... $4#$e#Y-you did a good job with the Community Center.#$b#*whispers* Mayor Lewis should've paid you for the work, though.",
    "wonEggHunt": "Hey @, congrats on winning the egg hunt. It's pretty hard with Abigail out there. She's got a sharp eye.",
    "wonGrange": "You did really good with your grange display this year.#$b#To be honest, I love when anyone wins against Pierre.$1",
    "wonIceFishing": "Good job with the ice fishing!#$b#I'd love to try it, but I'm so bad at fishing.$4",
    "married_farmer": "Hey, @, congrats on getting married. I really hope you and your spouse have a good future.",
    "divorced_farmer": "... I heard that you got divorced. I've never done marriage before, but I hope it gets easier for you sooner rather than later.$4#$e#*whispers* I hope I said the right thing.$4",
    
    // || data/dialogue/giftResponses.json ||
    "AcceptBirthdayGift_Loved": "W-wait, really? For my birthday? I appeciate the gift. This is pretty awesome.",
    "AcceptBirthdayGift_Liked": "Thanks for the birthday gift. It's really cool.",
    "AcceptBirthdayGift_Hated": "... Thanks for remembering my birthday.$4",
    "AcceptBirthdayGift_Disliked": "Oh, uh, thanks for remembering my birthday.",
    "AcceptBirthdayGift_Neutral": "Thanks for remembering my birthday.",
    "AcceptBirthdayGift": "Thanks for remembering my birthday.",
    
    "AcceptGift_Loved_Cheese": "Oh, this is for me? I won't let you leave empty-handed. I really appreciate it.#$action AddMoney 500",
    
    "RejectItem_hidden": "Um...#$b#No thanks.$4",
    
    // || data/events.json ||
    "Arrival_1": "Damn, that was a long trip to get back home.$2",
    "Arrival_2": "Hm? Someone moved into the abandoned farm?",
    "Arrival_3": "I just hope they don't cause too much trouble...$2",
    
    // || data/festivals.json ||
        // Egg Festival
    "eggFestival_1": "I kinda wish there were less people here.$9#$b#I don't like crowded places. I like the festival itself, though.",
    "eggFestival_2": "I stay in the shade so I don't irritate my skin.#$e#It sucks getting heat rashes...$4",
    "eggFestival_3": "",
    "eggFestival_4": "",
    "eggFestival_5": "",
}