{
    //Event 1
    "event.confession.speak_1": "Hi @!$1#$b#I hope today hasn't been too stressful for you.",
    "event.confession.speak_2": "You know...#$b#There's something that I think might be worth mentioning...$2",
    "event.confession.speak_3": "...$2#$b#Please forgive me for being so forward about it, but I...$14#$b#I haven't had sex with anyone before.$4",
    "event.confession.speak_4": "I figured I'd mention it in case things ended up getting... *that* intimate between us.$4",
    "event.confession.speak_5": "... You're not bothered by it?$13#$b#That's such a relief!$1",
    "event.confession.speak_6": "...$4#$b#I want to make sure I do everything right the first time we do...$14#$b#$4*It*.$4",
    "event.confession.speak_7": "Oh my Yoba, why am I cursed to be so... flustered around @?$5",
    "event.confession.speak_8": "I'll do plenty of research! I promise!$1#$b#I want to make sure I don't mess anything up. I'll take a look at some literature to make sure I know what I'm doing.$1",
    "event.confession.speak_9": "Th-thanks for being so understanding...$4#$b#I'll see you later.$1",
    "event.confession.endDialogue": "I have many books to read. Hopefully Gunther has books that will help me learn everything that I need to know!",
    //Event 2
    "event.libraryBook.speak_1": "...$6",
    "event.libraryBook.speak_2": "...$6#$b#Oh, @! I found a book that fits exactly what I was looking for.$7",
    "event.libraryBook.speak_3": "This book is called 'Exploring The Body and Mind'. It's all about the fundamentals of sex. I've been able to learn a lot from just this book alone!$7",
    "event.libraryBook.speak_4": "I need to take these glasses off for a moment. My eyes are hurting.$6",
    "event.libraryBook.speak_5": "Much better.$1",
    "event.libraryBook.speak_6": "So, about the book. It mentioned how having a 'safeword' is ideal for sex. It's good for if a partner needs to stop or take a break.#$b#I think having a safeword would be perfect, just for the sake of taking precautions.$13",
    "event.libraryBook.speak_7": "You want to use 'meningitis' as a safeword?$3#$b#How about something more memorable like... 'marshmallow'?$12",
    "event.libraryBook.speak_8": "I'm glad that sounds great to you.$1#$b#I still have much more reading to do, but I'll let you know when I have new information to share.#$b#... I love you.$4",
    "event.libraryBook.endDialogue": "Remember, our safe work is 'marshmallow'.$1",
    //Letter - Event 3
    "mail.safewordPractice.body": "Hello @,^^Do you remember our conversation about using a safeword yesterday? The book I referenced suggests that we practice using it just so we know what we're doing for when we maybe do have sex one day.^^Meet me at my place between 6PM to 10PM if you can. I love you!^^From, Floradora Hibiscado",
    "mail.safewordPractice.title": "Safeword Practice",
    //Event 3
    "event.safewordPractice.speak_1": "Thanks for meeting me here, @. It really means a lot to me that you're willing to try this out.$1",
    "event.safewordPractice.speak_2": "So I've re-read this chapter about safewords some more and I'm feeling very confident that I'll do it right.$4#$b#I admit, I am a little shy about trying it out, but I know you're someone I can trust.$12",
    "event.safewordPractice.question": "Before we start, do you remember the safeword we agreed on using?",
    "event.safewordPractice.answer_1": "Meningitis",
    "event.safewordPractice.answer_2": "Mosquito",
    "event.safewordPractice.answer_3": "Marshmallow",
    "event.safewordPractice.answer_4": "Mint",
    "event.safewordPractice.correct": "I'm really happy that you remembered it!$12#$b#It's good to know you're listening during our conversations.$1#$b#I hope I'm a good listener when you're talking, too.$4",
    "event.safewordPractice.incorrect_1": "Not quite... The safe word we agreed on was 'marshmallow'.$2",
    "event.safewordPractice.incorrect_2": "It's okay, that's why we're practicing right now.$1",
    "event.safewordPractice.speak_3": "",
    "event.safewordPractice.speak_4": "",
    "event.safewordPractice.speak_5": "",
    "event.safewordPractice.speak_6": "",
    "event.safewordPractice.speak_7": "",
    "event.safewordPractice.speak_8": "",
    "event.safewordPractice.endDialogue": "Thanks for listening to our safeword. It's good to know that I can be safe with you.",
}

//Fresh graduate in clinical psychology
    //Maslow's Hierarchy of Needs
//0 Hearts - Very nervous
//2 Hearts - Overthinker "What if I bore the other person or make them mad?"
    //Profuse apology over sleeping in a towel
//4 Hearts - Embarassed over small social errors
//6 Hearts - Researching individuals w/o shared interests talking to each other
    //Starting to maintain eye contact
//8 Hearts - Not used to expressing her needs
    //Unsure of when a romantic relationship starts and friendship ends [mood]
//10 Hearts - Chronically clumsy and insecure about it
//Married - Book on how to identify others' emotions... autistic?

//Has a cute blush and smile
//Migraines when wearing glasses for long periods