{
    //Event 1
    "event.confession.speak_1": "Hi @!$1#$b#I hope today has been good for you so far.",
    "event.confession.speak_2": "You know...#$b#There's something that I think might be worth mentioning...$2",
    "event.confession.speak_3": "...$2#$b#Please forgive me for being so forward about it, but I...$14#$b#I haven't had sex with anyone before.$4",
    "event.confession.speak_4": "I figured I'd mention it in case things ended up getting... *that* intimate between us.$4",
    "event.confession.speak_5": "... You're not bothered by it?$3#$b#That's such a relief!$1",
    "event.confession.speak_6": "... It's difficult being so open about this, but I would really love it if *you* could be my first person to have sex with.$4#$b#Even more, I want to make sure I do everything right the first time we do...$14#$b#$4*It* together.$4",
    "event.confession.message_1": "Flor speaks in a very audible whisper.",
    "event.confession.speak_7": "Oh my Yoba, why am I cursed to be so... flustered around @?$5",
    "event.confession.speak_8": "I'll do plenty of research! I promise!$1#$b#I want to make sure I don't mess anything up. I'll take a look at some literature to make sure I know what I'm doing.$1",
    "event.confession.speak_9": "Th-thanks for being so understanding...$4#$b#I'll see you later.$1",
    "event.confession.endDialogue": "I have many books to read. Hopefully Gunther has books that will help me learn everything that I need to know!",
    //Event 2
    "event.libraryBook.speak_1": "...$6",
    "event.libraryBook.speak_2": "...$6#$b#Oh, @! I found a book that fits exactly what I was looking for.$7",
    "event.libraryBook.speak_3": "This book is called 'Exploring The Body and Mind'. It's all about the fundamentals of sex. I've been able to learn a lot from just this book alone!$7",
    "event.libraryBook.speak_4": "I need to take these glasses off for a moment. My eyes are hurting.$6",
    "event.libraryBook.speak_5": "Much better.$1",
    "event.libraryBook.speak_6": "So, about the book. It mentioned how having a 'safeword' is ideal for sex. It's good for if a partner needs to stop or take a break.#$b#I think having a safeword would be perfect, just for the sake of taking precautions.$13",
    "event.libraryBook.speak_7": "You want to use 'meningitis' as a safeword?$3#$b#How about something more memorable like... 'marshmallow'?$12",
    "event.libraryBook.speak_8": "I'm glad that sounds great to you.$1#$b#I still have much more reading to do, but I'll let you know when I have new information to share.#$b#... I love you.$4",
    "event.libraryBook.endDialogue": "Remember, our safe work is 'marshmallow'.$1",
    //Letter - Event 3
    "mail.safewordPractice.body": "Hello @,^^Do you remember our conversation about using a safeword yesterday? The book I referenced suggests that we practice using it just so we know what we're doing for when we maybe do have sex one day.^^Meet me at my place between 6PM to 10PM if you can. I love you!^^From, Floradora Hibiscado",
    "mail.safewordPractice.title": "Safeword Practice",
    //Event 3
    "event.safewordPractice.speak_1": "Thanks for meeting me here, @. It really means a lot to me that you're willing to try this out.$1",
    "event.safewordPractice.speak_2": "So I've re-read this chapter about safewords some more and I'm feeling very confident that I'll do it right.$4#$b#I admit, I am a little shy about trying it out, but I know you're someone I can trust.$12",
    "event.safewordPractice.question": "Before we start, do you remember the safeword we agreed on using?",
    "event.safewordPractice.answer_1": "Meningitis",
    "event.safewordPractice.answer_2": "Mosquito",
    "event.safewordPractice.answer_3": "Marshmallow",
    "event.safewordPractice.answer_4": "Mint",
    "event.safewordPractice.correct": "I'm really happy that you remembered it!$12#$b#It's good to know you're listening during our conversations.$1#$b#I hope I'm a good listener when you're talking, too.$4",
    "event.safewordPractice.incorrect_1": "Not quite... The safe word we agreed on was 'marshmallow'.$2",
    "event.safewordPractice.incorrect_2": "It's okay, that's why we're practicing right now.$1",
    "event.safewordPractice.speak_3": "I...$14#$b#Um...$4#$b#M-Maybe we can start with kissing?$12",
    "event.safewordPractice.speak_4": "S-sorry, I'm just very nervous about this.$12#$b#But I want to do it.$4",
    "event.safewordPractice.speak_5": "You're so gentle with me. I like it.$4",
    "event.safewordPractice.speak_6": "Mmm...$14#$b#Oh my... Your hands feel nice on my waist.$4",
    "event.safewordPractice.speak_7": "I didn't think it would be so easy for you to take my shirt off.$19#$b#Mmm... Your touch... It's is so light on my breasts...$27#$b#O-oh... Your kisses on my neck are...$26#$b#Mmm!!!$28#$b#W-wait- U-uh- Marshmallow!!$18",
    "event.safewordPractice.speak_8": "...$2#$b#I-I'm sorry... I just kinda freaked out a bit there...$2#$b#I think the sensations got a bit too overwhelming for me...$2#$b#B-but it's nothing to do with you! It's not your fault at all!$3",
    "event.safewordPractice.speak_9": "Listen... I appreciate you taking the time to try things out with me.$4#$b#I hoped I would be able to last a little longer, b-but I guess I'm still too nervous to get far enough.$14",
    "event.safewordPractice.speak_10": "I'm glad you had a good time too, @.$4",
    "event.safewordPractice.speak_11": "I think I'd like to be alone for a little bit. It was good getting to practice using a safeword with you.",
    "event.safewordPractice.endDialogue": "Thanks for listening to our safeword. It's good to know that I can be safe with you.$1",

    "event.underTheStars.speak_1": "Hello dear. You decided to come out so late?",
    "event.underTheStars.speak_2": "You know, I never thought I would be lucky enough to end up with someone like you...",
    "event.underTheStars.speak_3": "P-please don't take it the wrong way!$3#$b#What I mean is that I've struggled for a long time when it comes to maintaining social connections.$2",
    "event.underTheStars.speak_4": "Remember the research you helped me out with a while ago?",
    "event.underTheStars.speak_5": "Well, I struggle a lot socially. I think you can already tell that.$2#$b#Seeing what happens when strangers without common interests talk to each other... I saw I could still form new connections.#$b#It's not a guaranteed friendship, but I'm not doomed to failure just because I don't have a common interest in mind right away.$13",
    "event.underTheStars.speak_6": "You being there with me... It really helped me out.$4#$b#Not only did you contribute to the research with your own observations... you also gave the emotional support that I needed in that moment.$4",
    "event.underTheStars.message_1": "You can see how much love Flor has for you with the look in her eyes.",
    "event.underTheStars.speak_7": "I've struggled with being confident since I was a little girl. I always found it hard to connect with people.$2#$b#Not having social connections with people can be damaging on a child's cognitive and social development.$2#$b#You being with me during my research was one of the few times that I had someone be by my side... without judgement.$14",
    "event.underTheStars.speak_8": "I-I'm okay. I'm just not used to you approaching me so quickly like this.$4#$b#I know we're already married, but I still get butterflies when you get close to me like this.$14",
    "event.underTheStars.speak_9": "... And when you kiss me... I get very tempted to get more intimate with you.$4",
    "event.underTheStars.speak_10": "Let's go somewhere more... private.$1",
    "event.underTheStars.speak_11": "Here... Let me help you take your clothes off, honey.$4",
    "event.underTheStars.speak_12": "Mmmph~ Ah, keep kissing my neck honey.$28#$b#And... can you touch me with your hands more?$26",
    "event.underTheStars.speak_13": "You want to finger me?$25#$b#Just... please be gentle with me at first.$19",
    "event.underTheStars.speak_14": "F-fuck~ Yes, just like that...$27",
    "event.underTheStars.speak_15": "You can go faster if you want, @.$26#$b#It's up to you-$27",
    "event.underTheStars.speak_16": "Oh yes, more! More!$29",
    "event.underTheStars.speak_17": "I-I'm going to cum!$29#$b#Fuck!!!$29",
    "event.underTheStars.message_2": "Flor speaks while trying to catch her breath.",
    "event.underTheStars.speak_18": "I... feel amazing. E-even though my legs are shaking, I had a great time.$19#$b#... Thank you, @.$19",
    
    "event._____.speak_": "_______________",
}

//Fresh graduate in clinical psychology
    //Maslow's Hierarchy of Needs
//0 Hearts - Very nervous
//2 Hearts - Overthinker "What if I bore the other person or make them mad?"
    //Profuse apology over sleeping in a towel
//4 Hearts - Embarassed over small social errors
//6 Hearts - Researching individuals w/o shared interests talking to each other
    //Starting to maintain eye contact
//8 Hearts - Not used to expressing her needs
    //Unsure of when a romantic relationship starts and friendship ends [mood]
//10 Hearts - Chronically clumsy and insecure about it
//Married - Book on how to identify others' emotions... autistic?

//Has a cute blush and smile
//Migraines when wearing glasses for long periods